{"gonzaga": {"politics": ["It's official: Sanford facing Colbert Busch in SC The race for a vacant South Carolina congressional seat has turned into the big-name contest that political junkies were hoping for. Former South Carolina Gov. Mark Sanford, a Republican trying to make a comeback after his political career was ...", "Connecticut lawmakers vote on gun law Connecticut will likely become the third state to pass a major overhaul of its gun laws when its General Assembly votes Wednesday on a measure crafted in the wake of the December massacre at an elementary school in the state. Lawmakers announced ...", "Senate Ed endorses SB 1199 with just one dissenting vote The Senate Education Committee has approved SB 1199 with just one dissenting vote, from Sen. Branden Durst, D-Boise. Sen. Russ Fulcher, R-Meridian, moved to send the bill to the full Senate with a recommendation that it pass. “It’s not ...", "Sen. Ed Murray: GOP budget has Democrat input, but he doesn’t consider it bi-partisan Senate Democratic Leader Ed Murray says the budget being released today by the GOP-led majority has input from Democrats, but he does not consider it bi-partisan. The majority caucus is expected to release its spending proposal at noon on ...", "Uganda: Suspicious Man Cuts Cheating Wife's Legs Jjingo Gonzaga was dragged to the Police by a group of residents who arrested him as he attempted to amputate his wife Agnes Nakasozi. Gonzaga also threatened to kill one John Mayanja whom he said kissed and danced with his wife at a dance held at Nkuke ...", "A sampling of editorials from around New York The New York Daily News on the economic benefits of hydrofracking and Gov. Andrew Cuomo's failure so far to approve it. March 31 Although he is famously averse to leaving New York State, Gov. Cuomo would be well advised to make a day trip 60 miles across ...", "Ventnor man, 23 years after Galloway murder, tells judge he 'did the crime' MAYS LANDING — As he wiped away tears with his handcuffed hands at his first hearing in court, the accused murderer in a Galloway Township cold case admitted to the crime. Steven L. Goff, 41, of Ventnor, turned himself in to Galloway police at ...", "Wizards top Bulls 90-86 for 8th straight home win Authorities captured an elusive survivalist on Tuesday who is suspected of burglarizing Utah cabins and leaving some covered with threats and bullet holes _ ending a saga that began six years ago and grabbed the attention of police and residents around the ...", "Likely $1M hole looms over Fitchburg schools FITCHBURG -- Fitchburg Public Schools may be facing a $1 million deficit for fiscal 2014, district officials announced at Monday night's School Committee meeting. Superintendent of Schools Andre Ravenelle said he and his staff would be doing ...", "David Harsanyi commentary | Obamacare is still worth fighting P.J. O’Rourke once remarked, “Feeling good about government is like looking on the bright side of any catastrophe. When you quit looking on the bright side, the catastrophe is still there.” With all the doom and gloom free-market advocates ...", "Whitver: Reliance on federal funds not good scenario for Iowa One of the biggest issues facing the state of Iowa is the reliance we have on the federal government. When looking at the entire state budget, it is interesting to note the different funding sources. In fiscal year 2013, almost half of our state ...", "Obradovich: Another dust-up in Iowa over young gays During a week of national discussion over same-sex marriage, it was no surprise that religious conservatives in Iowa seized the chance to stand up for their values. The Family Leader and a group of lawmakers held a news conference on Thursday ...", "Burke leads UM rally over Kansas, 87-85 in OT U.S. Rep. Chris Gibson, R-Kinderhook, is among a handful of politicians state Republican leaders are considering as a challenger for Gov. Andrew Cuomo, a Democrat, in 2014, two local county Republican chairmen said Monday. In South Glens Falls, new leaders ...", "Obama takes in Syracuse-Marquette game (CNN) – March is almost over, but the madness continues for President Barack Obama, who took in Saturday’s Syracuse-Marquette matchup at Washington’s Verizon Center. Obama picked neither team to reach the Elite Eight on his NCAA bracket ...", "Candidates for Broward County Court judge She previously worked as a Hillsborough County assistant public defender. Education: Undergraduate degree from University of Miami, 1976; law degree from Gonzaga University in Spokane, Wash., 1979. Civic: Volunteer for Broward County Legal Aid ...", "Likely $1M hole looms over Fitchburg schools FITCHBURG -- Fitchburg Public Schools may be facing a $1 million deficit for fiscal 2014, district officials announced at Monday night's School Committee meeting. Superintendent of Schools Andre Ravenelle said he and his staff would be doing ...", "David Harsanyi commentary | Obamacare is still worth fighting P.J. O’Rourke once remarked, “Feeling good about government is like looking on the bright side of any catastrophe. When you quit looking on the bright side, the catastrophe is still there.” With all the doom and gloom free-market advocates ...", "Whitver: Reliance on federal funds not good scenario for Iowa One of the biggest issues facing the state of Iowa is the reliance we have on the federal government. When looking at the entire state budget, it is interesting to note the different funding sources. In fiscal year 2013, almost half of our state ...", "Obradovich: Another dust-up in Iowa over young gays During a week of national discussion over same-sex marriage, it was no surprise that religious conservatives in Iowa seized the chance to stand up for their values. The Family Leader and a group of lawmakers held a news conference on Thursday ...", "Burke leads UM rally over Kansas, 87-85 in OT U.S. Rep. Chris Gibson, R-Kinderhook, is among a handful of politicians state Republican leaders are considering as a challenger for Gov. Andrew Cuomo, a Democrat, in 2014, two local county Republican chairmen said Monday. In South Glens Falls, new leaders ...", "Obama takes in Syracuse-Marquette game (CNN) – March is almost over, but the madness continues for President Barack Obama, who took in Saturday’s Syracuse-Marquette matchup at Washington’s Verizon Center. Obama picked neither team to reach the Elite Eight on his NCAA bracket ...", "Candidates for Broward County Court judge She previously worked as a Hillsborough County assistant public defender. Education: Undergraduate degree from University of Miami, 1976; law degree from Gonzaga University in Spokane, Wash., 1979. Civic: Volunteer for Broward County Legal Aid ...", "In news, it matters what’s missing See the “shocking” upset of Gonzaga by Wichita State?) and a features story, either on a team, a coach or a player (such as Arsalan Kazemi, the 6-foot-7-inch Oregon Ducks forward from Iran or Florida Gulf Coast as a possible Cinderella team ...", "Rescued stray alerts sleeping owner to burning Burien home A dog who was found on the streets in terrible shape and then nursed back to health by his adoptive \"mom\" returned the favor by jumping on her while she slept to alert her that the house was on fire. Elizabeth Huntington says on Monday night ...", "Are Iowa and New Hampshire “The Problem”? In “Iowa and New Hampshire, the GOP’s primary problem,” the Washington Post’s Richard Cohen reacts to the Republican National Committee’s (RNC’s) “Growth and Opportunity Project” report “Missing from the report are any critical ...", "Noah Wick Joins GCG’s Seattle Office The company that placed this press release with PRWeb is responsible for its content. It is not edited by the Albany Times Union. The Garden City Group, Inc. (GCG), a recognized leader in class action settlement and bankruptcy administration, is proud to ...", "An Open Letter About Ashley Judd In Hollywood, \"no\" is silence over time. The way you find out you're not getting the job, that they passed, that they didn't respond to the material, that they're going a different direction, is silence. It's the call you don't get. No one wants to give ...", "Commentary John Carroll and Gonzaga. You probably recognize some of them because of March Madness! Not to be outdone, a small group of French missionary priests, not Jesuits, but in the Order of the Congregation of the Holy Cross, established Notre Dame ...", "State Police: Roads becoming hazardous The road conditions in the area have become snow packed, icy and slick. The counties included in the Lafayette District are Carroll, Clinton, Benton, Warren, White, Montgomery, Fountain and Tippecanoe, reported Indiana State Police on Sunday ...", "Americans leave GOP behind in support for marriage equality also, i have to tell you that gonzaga last on saturday night, so my ncaa bracket is over and done with. and most amazingly, smu announced today that the george w. bush presidential library is almost ready to open. they have set a date. the george w."], "business": ["Southern makes Gonzaga work to the finish QUEENSBURY -- A woman who is wanted in Missouri on three felony charges was arrested Monday trying to shoplift at the Wal-Mart store on Route 9, police said. Chris Gibson eyed as foe to Andrew Cuomo in 2014 U.S. Rep. Chris Gibson, R-Kinderhook, is among a ...", "Sacramento, Seattle groups present to NBA owners Representatives from Sacramento and Seattle are making their presentations before NBA owners, hoping to show their city is the best home for the Kings franchise. A Seattle group headed by investor Chris Hansen and Microsoft CEO Steve Ballmer has ...", "EU flag flies over Prague castle, not all happy For the first time in almost a decade, the blue-and-gold European Union flag is flying above Prague Castle. But there's already a movement to take it down. The new president, Milos Zeman, says the flag is a long overdue sign that the country is ...", "US service firms grow more slowly, hiring weakens U.S. service companies grew more slowly in March, while private employers pulled back on hiring, reports Wednesday showed. The declines suggest businesses may have grown more cautious last month after federal spending cuts took effect. The Institute for ...", "Hyundai, Kia recalling 1.6 million vehicles Kia and Hyundai, Korean sister auto companies, said Wednesday that they are recalling over 1.6 million vehicles. The cars, it seems, share a defect in their brake lamps. The brake lamp problem is compounded because it sends incorrect signals to ...", "Regan: Woulda Come If Invited In today's letters to the editor in the Coeur d'Alene Press, Trustee Brent Regan responds to criticism by Sorensen Magnet School fund-raising chairman Adam Graves re: lack of trustees at auction: Mr. Graves, regarding your My Turn of March 30. I ...", "Metro Transit says it may need to cut routes In this time when Metro routes may be cut to save money, instead I think that a rescheduling of Metro buses could save lots. [“Without taxes, Metro warns of big cuts,” NWTuesday, April 2.] I live in Bellevue and walk every night. When ...", "More than 2,100 Cleco customers in Rapides Parish without power More than 2,000 customers of Cleco Corp. were without electricity at midday Tuesday, according to the Pineville energy company's website. As of 1 p.m., Cleco reported 2,122 customers without power in Rapides in the wake of Sunday's damaging windstorm. In ...", "OUR TOWN: April 3 Gehly, an 8th-grader at B.C. High Arrupe Division, won a Gonzaga scholarship. He is the son of Darryl and Katherine Gehly. Leary, a student at Rising Tide Charter School in Plymouth, won an Academic Merit scholarship. He is the son of Christopher and ...", "Notre Dame and UConn headline women's Final Four DES MOINES — Ten lawmakers will likely have the final say on what education reform package makes it to Gov. Terry Branstad’s desk. The case of a Zumba instructor charged with prostitution in Maine reads a bit like a TV script. And there's nothing to ...", "Make your house look like a 'million dollar listing' for less (BPT) - A new report reveals houses are selling faster and for more money, yet another indicator of a rebounding housing market. According to the National Association of Realtors, full-year sales of previously owned homes increased by 9 percent ...", "Maloof brothers no longer Kings of Sacramento The moment will be seared into the minds of long-suffering Sacramento Kings fans forever. Sacramento Mayor Kevin Johnson and Kings owners Joe and Gavin Maloof standing together at center court, holding hands and raising their arms in triumph ...", "Activist collects Unitil bills in drive FITCHBURG -- Lunenburg resident Cathy Clark has done a lot on her own to lobby against the way Unitil handled the 2008 ice storm. So when she heard that many residents were seeing their bills drastically increase from one month to the next this ...", "Seattle Mayor travels to NYC to join arena pitch Seattle Mayor Mike McGinn and King County Executive Dow Constantine will travel to New York City as part of Chris Hansen's pitch to NBA owners. Groups from Sacramento and Seattle will make presentations to twelve NBA owners on Wednesday. This ...", "Claims administrator seeks dismissal of BP lawsuit NEW ORLEANS — The court-appointed claims administrator for a multibillion-dollar settlement between BP PLC and a team of private plaintiffs' attorneys asked a federal judge Monday to throw out the company's lawsuit against him. The suit that ...", "Notre Dame and UConn headline women's Final Four DES MOINES — Ten lawmakers will likely have the final say on what education reform package makes it to Gov. Terry Branstad’s desk. The case of a Zumba instructor charged with prostitution in Maine reads a bit like a TV script. And there's nothing to ...", "Make your house look like a 'million dollar listing' for less (BPT) - A new report reveals houses are selling faster and for more money, yet another indicator of a rebounding housing market. According to the National Association of Realtors, full-year sales of previously owned homes increased by 9 percent ...", "Maloof brothers no longer Kings of Sacramento The moment will be seared into the minds of long-suffering Sacramento Kings fans forever. Sacramento Mayor Kevin Johnson and Kings owners Joe and Gavin Maloof standing together at center court, holding hands and raising their arms in triumph ...", "Activist collects Unitil bills in drive FITCHBURG -- Lunenburg resident Cathy Clark has done a lot on her own to lobby against the way Unitil handled the 2008 ice storm. So when she heard that many residents were seeing their bills drastically increase from one month to the next this ...", "Seattle Mayor travels to NYC to join arena pitch Seattle Mayor Mike McGinn and King County Executive Dow Constantine will travel to New York City as part of Chris Hansen's pitch to NBA owners. Groups from Sacramento and Seattle will make presentations to twelve NBA owners on Wednesday. This ...", "Cal rallies past Georgia to reach first Final Four QUEENSBURY -- A woman who is wanted in Missouri on three felony charges was arrested Monday trying to shoplift at the Wal-Mart store on Route 9, police said. Chris Gibson eyed as foe to Andrew Cuomo in 2014 U.S. Rep. Chris Gibson, R-Kinderhook, is among a ...", "Claims administrator seeks dismissal of BP lawsuit NEW ORLEANS — The court-appointed claims administrator for a multibillion-dollar settlement between BP PLC and a team of private plaintiffs' attorneys asked a federal judge Monday to throw out the company's lawsuit against him. The suit that ...", "Free E-Waste Recycling Event April 20, 2013 at Point Loma Library, San Diego CA The San Diego-based nonprofit PCs4Vets will be hosting a free e-waste recycling event on Saturday, April 20th, 2013 at the Point Loma Library in 3701 Voltaire St, San Diego, CA 92107. The event shall begin at 10:00 AM and continue until 3:00 PM. The public ...", "James 'Dallas' Price He was the youngest of six children. He attended Saint Joseph’s Academy and graduated in 1954. He attended Gonzaga University for one year before he left to return home to care for his beloved ailing mother. He never complained, only accepting life as it ...", "Meredith CEO Lacy: We'll 'take a close look' at buying WHO-TV WHO-TV is going on the market, and Meredith Corp. CEO Steve Lacy says he will take a look at buying the Des Moines station. Local TV LLC, which owns WHO, is putting up its 21 stations for sale, according to reports in Broadcast & Cable and other ...", "Business awards & achievements He earned a bachelor's degree in comprehensive communications from Cedarville University and a master's degree in organizational communications and leadership from Gonzaga University, Spokane, Wash. •Tastefully Simple, a national direct sales ...", "Brown's motorsports marketing company for sale The motorsports marketing company founded by the top candidate to become the next CEO of IndyCar is for sale. Zak Brown informed the staff of Just Marketing Inc. by letter this weekend that Spire Capital Partners is trying to sell its 60 percent stake in ...", "Charlene recalls Miss Universe Q&A So I had to think of a way para ma-distract sila. So ano ba talaga high tide or low tide. Kaya ganoon,” Gonzales told co-hosts Boy Abunda and Toni Gonzaga. Gonzales, who finished in the Top 6 during the pageant, said her answer came after she visited an ...", "New fly-fishing store set to open in Tulsa Northwest Arkansas' loss is Tulsa's gain as longtime fly-fishing guide Ken Richards has, at least temporarily, put the streams of Arkansas, Missouri and Mississippi behind him to take the helm at Tulsa's new fly-fishing outlet at Backwoods, 6508 ...", "SOU Soccer Opens Season Thursday with High Expectations BANGKOK (AP) -- Japan's benchmark stock index fell Monday after a central bank survey showed a smaller-than-expected improvement in business sentiment. NEW YORK (AP) -- When the Dow first crossed 14,000, investors were overjoyed. ..."], "entertainment": ["Gonzaga students are 'Alive with Art' Despite Gonzaga’s heart-wrenching loss on Saturday, the GU community still had a lot to celebrate, namely its art. From dance to music, painting and more, GU student’s shared and celebrated the artistic talent the campus has to offer during “Alive ...", "Valencia College hosts 6th free Brazilian Film Festival Valencia College will kick off its 6th Brazilian Film Festival this Friday, April 5, with \"Gonzaga,\" the dramatic, complicated story of Brazilian pop hero Gonzaga and his son, pop star Gonzaguinha. During the weeklong festival, the college will ...", "Rolling Stones announce new tour On Wednesday, The Rolling Stones announced their \"50 and Counting\" tour, which will kick off in Los Angeles at the Staples Center on a date to be determined. The tour will include shows in Oakland, San Jose, Las Vegas, Anaheim, Toronto, Chicago ...", "It's official, Fallon to replace Leno on 'Tonight Show' Jay Leno says he will be leaving NBC’s “Tonight Show” next spring, to be replaced by Jimmy Fallon. Leno announced the move Wednesday in a news release. NBC also confirms that the show will be moving to New York City when Fallon takes over ...", "Rolling Stones announce 9-city tour Call it satisfaction: The Rolling Stones have announced a nine-city tour. The veteran rockers said Wednesday their \"50 and Counting\" tour will kick off in Los Angeles at the Staples Center. The date will be announced later. The second show is in ...", "Rush bassist gives guitar to Rock Hall Rush bassist and frontman Geddy Lee has given one of his guitars to the Rock and Roll Hall of Fame in advance of the band's induction. Lee used the hybrid Fender on the recording of \"Tom Sawyer,\" one of the Canadian trio's best-known songs. The instrument ...", "Come Heller high water: Skin color has nothing to do with state takeovers It just worked out that way. What was I thinking in picking Gonzaga to win? • Spring supposedly started at 11:02 a.m. March 20. But in my mind it officially started at 4:10 p.m. April 1, when Austin Jackson stepped to the plate against Twins pitcher ...", "Flavor up pork tenderloins When I informed my husband that I was going to make pork with a rhubarb sauce, he dismissed the idea out of hand. He does not like sweet in his savory. I tried to explain (as I have a thousand times before) that there’s a good reason why any ...", "PBS' 'Mr. Selfridge' has an eye for the ladies Jeremy Piven won three Emmys playing neurotic talent agent Ari Gold in \"Entourage,' which you might think is the pinnacle of his career. Think again. He's starring in the ITV/PBS production of \"Mr. Selfridge' and couldn't be more proud. \"Being ...", "Weekly Webb: Becoming Pinky and the Floyd She also sang in college and had technical training over the years. She hopped around the country a bit, attending Gonzaga in Spokane and living in Portland and Chicago before returning to Montana to finish her architecture degree. One thing got in her way ...", "Acts announced for Capitol Hill Block Party July 26-28 Three-day passes for the Capitol Hill Block Party are available now for $75. If you buy before Saturday, you can save $20. The lineup looks to be one of the best the festival has put together and features top-notch local and national acts. The ...", "Why the Sarah-John Lloyd tandem clicks Iba pag si John Lloyd, iba rin pag si Sarah,\" she said. \"I mean, we can always make Bea (Alonzo) Laida, or Toni (Gonzaga), Laida, you know, any actress. Pero magkakaroon ng ibang bihis, kasi bawat artista naman may iba't-ibang interpretasyong sa ibat ibang ...", "A celebrity chef's tips for scoring big with game-day partying (BPT) - Whatever sports you like to watch – whether pro levels or big collegiate moments such as the NCAA Men's Final Four, NCAA Frozen Four or College World Series – they all have one important thing in common: watching with friends makes ...", "Rob Ray Sanders commentary: Even King appreciated Dorsey's gifts April 4 will mark the 45th anniversary of Martin Luther King Jr.’s death, an event that shocked the nation when the civil-rights leader was felled by an assassin’s bullet. Moments before the single shot rang out, King had leaned over the ...", "Save Our Shows: Comedies need dramatic help Six jokey pals in various couplings is a formula that worked pretty well for Friends, but for Happy Endings it's been tougher sledding. In its third season, the show is averaging just 4.6 million viewers, hasn't aired for more than three weeks in a row and ...", "Weekly Webb: Becoming Pinky and the Floyd She also sang in college and had technical training over the years. She hopped around the country a bit, attending Gonzaga in Spokane and living in Portland and Chicago before returning to Montana to finish her architecture degree. One thing got in her way ...", "Acts announced for Capitol Hill Block Party July 26-28 Three-day passes for the Capitol Hill Block Party are available now for $75. If you buy before Saturday, you can save $20. The lineup looks to be one of the best the festival has put together and features top-notch local and national acts. The ...", "Why the Sarah-John Lloyd tandem clicks Iba pag si John Lloyd, iba rin pag si Sarah,\" she said. \"I mean, we can always make Bea (Alonzo) Laida, or Toni (Gonzaga), Laida, you know, any actress. Pero magkakaroon ng ibang bihis, kasi bawat artista naman may iba't-ibang interpretasyong sa ibat ibang ...", "A celebrity chef's tips for scoring big with game-day partying (BPT) - Whatever sports you like to watch – whether pro levels or big collegiate moments such as the NCAA Men's Final Four, NCAA Frozen Four or College World Series – they all have one important thing in common: watching with friends makes ...", "Rob Ray Sanders commentary: Even King appreciated Dorsey's gifts April 4 will mark the 45th anniversary of Martin Luther King Jr.’s death, an event that shocked the nation when the civil-rights leader was felled by an assassin’s bullet. Moments before the single shot rang out, King had leaned over the ...", "Save Our Shows: Comedies need dramatic help Six jokey pals in various couplings is a formula that worked pretty well for Friends, but for Happy Endings it's been tougher sledding. In its third season, the show is averaging just 4.6 million viewers, hasn't aired for more than three weeks in a row and ...", "Betty Allen 13.6 ppg, 6.4 rpg, 59.9 fg pct, 44.3 3-pt fg pct, 2.2 steals (58, 306) Doug McDermott, Creighton, 6-8, 225, junior, Ames, Iowa, 23.1 ppg, 7.5 rpg, 56.1 fg pct, 49.7 3-pt fg pct, 86.0 ft pct (44, 279) Kelly Olynyk, Gonzaga, 7-0, 238, junior, Kamloops ...", "McDermott repeats on AP All-America hoops team Two events, including the Tigris Shine Circus, will be held this weekend at the New York State Fairgrounds. ATLANTA (AP) — After a season of uncertainty, there's a clear favorite heading to the Final Four. WASHINGTON (AP) — If all Syracuse point guard ...", "Bills Head For the Copa-Kolb-ana Now here’s where I’m about to zig where a million people are zagging and no I’m not talking about those poor Gonzaga fans out there: I l Original Story: http://football.razzball.com/bills-he...", "[Interview] Chatting Basketball, ‘Disarm The Descent’, And The Simpsons With Killswitch Engage’s Justin Foley Now I just have to watch and make sure that everyone I picked loses like usual. BD: Who do you have winning? JF: I have Gonzaga beating Georgetown in the finals. BD: I’m a Wolverines guy so that’s who I have to go with. JF: I do have them knocking off ...", "Baseball team takes form with help of good pitching On Thursday, prominent writer and lesbian Barrie Jean Borich presented a reading of her new memoir, Body Geographic, in the Harge Forum of the Multicultural Center, hosted by the gender and women’s studies department. The reading was well attended and ...", "KKHS’ spring concert to include special guests The concert will include a a guest appearance by the husband-and-wife team David and Kyla Fague. David Fague is the director of jazz studies at Gonzaga University, and Kyla Fague is adjunct music professor at Whitworth University. The spring concert ...", "John Lloyd Cruz: ‘It’s my dream to be a good provider’ Whoever he is teamed up with—be it Bea Alonzo, Sarah Geronimo, Angel Locsin or Toni Gonzaga—Cruz manages to make viewers believe he is truly, madly, deeply in love with each of them. Asked whether he makes it a point to know his costar before they are ...", "Mantua: Italy's sleeping beauty city For 400 years this was the home of the Gonzaga family, the dukes of Mantua who ruled until 1707, putting their stamp on everything, much as the Medicis did in Florence. The labyrinth includes a castle, basilica, courtyards, sumptuous galleries ...", "Good Friday tradition continues in Nashua When The Rev. Marcos Gonzalez-Torres first learned a few years ago that he would be coming to Nashua and to St. Louis de Gonzaga Church, he researched the area on the internet to learn more about it. What he read about its Tree Streets neighborhood ..."]}, "westeros": {"politics": ["Rep. Keith Ellison calls for federal housing director’s firing while protesting homeowner’s eviction Rep. Keith Ellison (D-MN) slammed the acting Federal Housing Finance Agency director Ed DeMarco during a rally on Tuesday supporting a Minneapolis homeowner in her fight against the foreclosure of her home. “We need to be finding ways to keep ...", "NKorea denies SKoreans passage across border to enter factory that is last symbol of detente North Korea on Wednesday barred South Korean workers from entering a jointly run factory park just over the heavily armed border in the North in the latest sign that Pyongyang's warlike stance toward South Korea and the United States is moving from words ...", "Report: Jimmy Fallon sets 'Tonight Show' deal, while 'Late Night' eyes Seth Meyers NBC's late-night picture continues to simultaneously get clearer and more cloudy. When will this transfer of power take place? How and when will NBC formally announce the deal? It's decidedly unclear. Jay Leno's \"Tonight Show\" contract runs through ...", "France Will Now Reimburse The Cost Of Abortions, Provide Free Contraception To Teen Girls Beginning yesterday, France will provide access to free birth control for teenaged girls ages 15 to 18 without parental notification, as well as reimburse the cost of abortions to all women over age 18. Pinch me. Am I dreaming? It’s not still ...", "The Most Hated Man in the Senate Not surprisingly, the freshman from Texas has irritated Democrats. Sen. Dianne Feinstein described him as \"arrogant\" and \"patronizing\" after the new arrival offered the 20-year Senate veteran a lesson on the constitution during a debate over ...", "White House: All quiet on the 38th parallel -- still Pushing back against reporting in an article by the Washington Free Beacon, the White House reiterated on Monday that North Korea has not altered its military posture since its steep uptick in belligerent rhetoric last week. In a Monday press ...", "Tenth Circuit will hear Hobby Lobby birth control benefit appeal The United States Court of Appeals for the 10th Circuit has granted Hobby Lobby’s request for a full court hearing of its challenge to the birth control benefit requirement in the Affordable Care Act. And as Jodi Jacobson at RH Reality Check ...", "‘Game of Thrones’ Recap: “Valar Dohaeris” As is necessary with a show like Game of Thrones, the first episode of this third season is concerned both with reiterating the larger forces advancing on Westeros—it begins beyond the Wall, where Samwell Tarly is pursued by the White Walkers ...", "Opening Belz, April 1 but too many still drive to MSP to fly – News Tribune New Columbia journalism dean doesn’t have a Twitter account – NY Times Parody: Mike Allyn’s Westeros Playbook – Free Beacon", "North Korea’s Nuclear Cul-de-Sac The mutual bluster and braggadocio persisted over the weekend on the Korean peninsula, as North Korean leader Kim Jong-un continued to drive his state down an atomic dead-end. He brayed anew at the state of war between his impoverished nation ...", "The man America needs: Stannis Baratheon That leader is: Stannis Baratheon, true heir to the Iron Throne of Westeros. While Obama and Congressional Republicans sat around blaming each other before, during, and after the improperly handled sequestration crisis, Stannis took action.", "Riding high: Toyota donates SUV to Staten Island ex-Marine through Wounded Warrior Project After proudly serving his adopted country in the military, an ex-Marine who lives on Staten Island took one step closer to achieving the American Dream — scoring a brand-new car. Alexander Presman, who was injured while serving in Iraq during 2003, was ...", "Science persecution in the United States *Lysenkoism is a grave crime against humanity, and any society that harbors it will pay dearly. *There’s more than one way for a self-deceiving regime to starve its population from crop failure. http://www.the-scientist.com/?articles.view ...", "Mojo - March 2013 They remain a fitting commentary, for as in the real world, politics in Westeros is not getting any less sleazy. What would this influence look like? There could be clues from Zuckerberg's last foray into advocacy work, the high-profile $100 ...", "A World Without Ashley Judd It was only fair that the news broke on Twitter. At 2:07 p.m., Kentucky time, actress and activist Ashley Judd tweeted that she’d “decided” on her next move. Over seven more tweets, she explained that she was “currently unable to ...", "Riding high: Toyota donates SUV to Staten Island ex-Marine through Wounded Warrior Project After proudly serving his adopted country in the military, an ex-Marine who lives on Staten Island took one step closer to achieving the American Dream — scoring a brand-new car. Alexander Presman, who was injured while serving in Iraq during 2003, was ...", "Science persecution in the United States *Lysenkoism is a grave crime against humanity, and any society that harbors it will pay dearly. *There’s more than one way for a self-deceiving regime to starve its population from crop failure. http://www.the-scientist.com/?articles.view ...", "Mojo - March 2013 They remain a fitting commentary, for as in the real world, politics in Westeros is not getting any less sleazy. What would this influence look like? There could be clues from Zuckerberg's last foray into advocacy work, the high-profile $100 ...", "A World Without Ashley Judd It was only fair that the news broke on Twitter. At 2:07 p.m., Kentucky time, actress and activist Ashley Judd tweeted that she’d “decided” on her next move. Over seven more tweets, she explained that she was “currently unable to ...", "Grassley Plans to Offer Gun Bill The top Republican on the Senate Judiciary Committee is preparing legislation that would offer a GOP approach to reducing gun violence. Sen. Charles Grassley (R., Iowa) plans to have his bill ready by the time Senate Majority Leader Harry Reid ...", "Act now, and receive two extra things! Three things for the price of ONE thing! It’s Stop Talking Man and his faithful sidekick Seriously Shut the Fuck Up Boy. Season 3 of Game Of Thrones: everyone in Westeros agrees to settle power succession though an actual Game of \"Musical Thrones. If you do 13 consecutive roundhouse ...", "Biggest Threat to U.S. National Security: Wars Soldiers slog through the mud of Iraq, February 2006. Photo: U.S. Army In 2004, Osama bin Laden explained how his terrorists were going to win its struggle against a vastly more powerful adversary: al-Qaida sought to “blee[d] America to the point of ...", "Wait, Did the System Just Work? The Obama White House deployed a new unmanned aerial vehicle last week: the drone trial balloon. According to several well-placed leakers, the CIA's not-so-secret targeted killing program will probably be not-so-secretly handed over to the ...", "Former U.S. Defense Chief: Time for Quiet Diplomacy on Cyber Attacks Former U.S. Defense Secretary William Cohen just finished a week’s stay in Beijing where cybersecurity was at the top of his agenda in meetings with foreign policy experts here. While the publicity given to China’s alleged hacking of U.S ...", "Shadow Government: Saving Hugo Chávez As a former U.S. official with substantial experience in Venezuela, I was not surprised, but still outraged to hear the temporary new leader of that country, Nicolas Maduro, accuse the United States of murdering his predecessor, Hugo Chávez. I ...", "The GOP's latest filibuster threat: Gun control en. Rand Paul (R-Ky.) got a lot of mileage out of his 13-hour, old-fashioned filibuster of John Brennan's confirmation as the new CIA director. Yes, Paul failed to stop the nomination, but he did call plenty of attention to the Obama administration's use ...", "Will the GOP nominee support gay marriage in 2016? he Supreme Court is hearing two landmark cases on same-sex marriage this week, but \"one thing is already clear: The political debate over gay marriage is over,\" says Chris Cillizza at The Washington Post. Politicians and their strategists can read polls ...", "Stats junkie successfully predicts another African coup Political scientist Jay Ulfelder, who's quickly becoming the Nate Silver of coups, has accurately predicted another one with the ouster of President Francois Bozizé of the Central African Republic. On Monday, rebel fighters cemented control ...", "Aaron Swartz Prosecutors Threatened With Guillotine Postcards WASHINGTON -- Two federal prosecutors involved in the case against the late Aaron Swartz have faced \"harassing and, at times, threatening communications\" from supporters of the Internet activist, the Justice Department said in a court filing. Government ...", "Making policy is tough War is endemic, and personal ambition is rampant. All this and the people in the land of Westeros are facing the frightening prospect of massive climate change in the form of a decades-long winter. Do they have the will to resist this? No. Sound familiar?"], "business": ["A Very Necessary Guide To The Best Places To Pee In Public Today is a sad day. The Whole Foods at Union Square in Manhattan finally figured out my trick — I’ve been using their bathrooms as a public restroom without ever buying anything for years. As of today, there are now complicated locks on the ...", "Oil price falls to below $97 a barrel as report seen confirming growing US supplies of crude The price of oil fell below $97 a barrel Wednesday ahead of the release of a report that's expected to confirm crude supplies are still burgeoning. By early afternoon in Europe, benchmark oil for May delivery was down 49 cents to $96.70 a barrel in ...", "GM, Ford and Chrysler post best U.S. sales since 2007 General Motors (NYSE: GM – news) , Ford (NYSE: F – news) and Chrysler (Xetra: 710000 – news) reported their best US sales performances since 2007 on Tuesday amid booming overall auto demand following the US industry’s near-collapse five ...", "‘Game of Thrones’ season 3 ratings and illegal downloads breaking records Game of Thrones on HBO ratings are looking good as announced today, April 1st, 2013. The numbers look even better than the season 2 finale. HBO’s Game Of Thrones returned for its third season with a record-breaking 4.4 million viewers last night. The one ...", "Morning MarketBeat: Rally Showing Its Stamina MARKET SNAP: At 4:55 a.m. ET, Treasury yields mostly unchanged. Nymex at $96.81, down $0.42; gold at $1,599.00, up $1.40. Europe markets closed for a holiday. In Asia, Nikkei 225 down 2.1% and Hang Seng down 0.7%. Overnight action: India court ...", "$21,000 robot Nao is newest teacher at Kansas high school HUTCHINSON, Kan. — The newest teacher at the Hutchinson school district's Career and Technical Education Academy can demonstrate tai chi moves and also display a little bathroom humor. It's Nao, the robot. In 2012, the district received a grant worth $ ...", "David and Victoria Beckham Put Hertfordshire Mansion Up For Sale It was their first proper family home that became known as Beckingham Palace but after 14 years David and Victoria Beckham have decided to say goodbye and have put their mansion on the market. The couple are selling their Hertdfordshire pile but ...", "Craft Brewers Face Regulatory Challenges One craft brewer, for example, told DeCelle that an FDA regulator who inspected his brewery had suggested that the new FSMA required the brewery to refrigerate its grain—something that flies in the face of beermaking and industry standards ...", "5 new revelations about Adam Lanza and the Sandy Hook massacre n Thursday, Connecticut authorities unsealed search warrants and police reports pertaining to the Sandy Hook Elementary school massacre in Newtown, Conn., offering a trove of new information about shooter Adam Lanza to the public. Connecticut Governor ...", "Navy moving ahead with its stealth attack drone program The Navy is moving ahead with its effort to field a stealthy, carrier-based attack drone. Yesterday, the sea service announced that it plans to give Boeing, Lockheed Martin, Northrop Grumman, and General Atomics contracts to flesh out their ...", "States Answer Help Wanted Ad to be Drone Test Site (LOS ANGELES) — It’s the land where Chuck Yeager broke the sound barrier, where the space shuttle fleet rolled off the assembly line and where the first private manned rocketship climbed to space. Capitalizing on Southern California’s ...", "Why Do Republicans Hate San Francisco? Follow stories by Matthew Yglesias. MySlate is a new tool that lets you track your favorite parts of Slate. You can follow authors and sections, track comment threads you're interested in, and more. There's no mystery as to why the National ...", "The 2013 Gelber Prize winner: Chrystia Freeland's 'Plutocrats' Last month, we posted interviews with the authors of the books nominated for the 2013 Gelber Prize, a literary award for the year's best non-fiction book in English on foreign affairs sponsored by the Munk School of Global Affairs at the ...", "CD Sales On Decline, But Death Not Imminent The death of the CD has been a highly anticipated event by consumers and corporations alike over the past decade, though recent statistics released by the Recording Industry Association of America (RIAA) - the trade organisation that supports and ...", "Judge gives nod to American Airlines merger with US Airways WASHINGTON - American Airlines has won the approval of the bankruptcy court to combine with US Airways, moving a step closer to the formation of the world's biggest airline. The approval is an important milestone for American, which filed for bankruptcy in ...", "States Answer Help Wanted Ad to be Drone Test Site (LOS ANGELES) — It’s the land where Chuck Yeager broke the sound barrier, where the space shuttle fleet rolled off the assembly line and where the first private manned rocketship climbed to space. Capitalizing on Southern California’s ...", "Today in business: 5 things you need to know In the latest sign that the housing recovery is gathering strength, home prices rose in January by the most since June 2006, according to the S&P/Case-Shiller index of property values in 20 cities. Prices jumped by 8.1 percent over the same month a year ...", "Why Do Republicans Hate San Francisco? Follow stories by Matthew Yglesias. MySlate is a new tool that lets you track your favorite parts of Slate. You can follow authors and sections, track comment threads you're interested in, and more. There's no mystery as to why the National ...", "The 2013 Gelber Prize winner: Chrystia Freeland's 'Plutocrats' Last month, we posted interviews with the authors of the books nominated for the 2013 Gelber Prize, a literary award for the year's best non-fiction book in English on foreign affairs sponsored by the Munk School of Global Affairs at the ...", "The Right Way to Do Stimulus A woman joins thousands of people protesting against the austerity measures of the Portuguese government in Lisbon on March 15. Photo by Patricia De Melo Moreira/AFP/Getty Images With much of the global economy apparently trapped in a long and ...", "CD Sales On Decline, But Death Not Imminent The death of the CD has been a highly anticipated event by consumers and corporations alike over the past decade, though recent statistics released by the Recording Industry Association of America (RIAA) - the trade organisation that supports and ...", "Judge gives nod to American Airlines merger with US Airways WASHINGTON - American Airlines has won the approval of the bankruptcy court to combine with US Airways, moving a step closer to the formation of the world's biggest airline. The approval is an important milestone for American, which filed for bankruptcy in ...", "Australia shares seen subdued, euro zone worries linger SYDNEY, March 28 (Reuters) - Australian shares are likely to open lower on Thursday, the last day of trade before the Easter holiday, following a subdued session on Wall Street amid ongoing concerns about the Cyprus financial crisis. * Local share price ...", "Aussie Record Labels To Face The Music Over Unfair Pricing The Parliamentary inquiry into digital IT pricing, investigating why Australian consumers are paying up to 50% more for digital music and software, has taken an interesting turn that will see Australian record labels brought before the Canberra committee ...", "Monsanto And DuPont Settle Genetically Modified Seed Battle * DuPont to pay minimum $1.75 billion in royalties over several years * Deal throws out $1 billion court verdict DuPont owed Monsanto * DuPont shares down 0.9 percent; Monsanto up 3.7 percent By Carey Gillam March 26 (Reuters) - Monsanto Co and DuPont have ...", "Starbucks To Start First Farm In Costa Rica To Cultivate New Types Of Coffee Beans With the official start of spring, it seems even Starbucks has gardening on the brain. The Seattle-based chain announced this week the purchase of its first farm, a roughly 600-acre plot in Costa Rica where the coffee giant plans to grow its own coffee ..."], "entertainment": ["East meets Westeros in Chinese 'Game of Thrones' commercial With the much-anticipated third season of HBO's Game of Thrones just getting underway, lots of people are rushing to capitalize on the show's roaring success. One of the more bizarre attempts recently surfaced on China's CCTV, which aired a ...", "The Women of Westeros Starting next week, this blog space on Mondays will be given over to The Orange Couch recaps of “Mad Men” (sadly, we had to cut “Doctor Who” because we don’t have time for both), so I won’t have a lot of time to talk about that other ...", "Game of Thrones: Recapping the Return to Westeros Laura, I hope this crow finds you well. I send it to discuss a tale I don’t doubt you’ve heard: that of “Valar Dohaeris,” the season premiere of Game of Thrones! After so long a wait, I feel it a matter of great urgency to discuss. First, a rec ..", "‘Game of Thrones’ Recap: Welcome Back to Westeros (Video) Poor Samwell Tarly: He begins Season Three of HBO’s “Game of Thrones” lost in the frozen zombie wasteland beyond the Wall, the fate of Westeros having slipped through his frigid fingers. Poor Tyrion Lannister: The diminutive – and now ...", "Margaery Tyrell is the Princess Di of Westeros. Photo by Helen Sloan/HBO. Every week in the Game of Thrones TV Club, Rachael Larimore will IM with a different fan of the show about the goings-on in Westeros and across the Narrow Sea. This week she discusses the season premiere with Seth ...", "‘Game of Thrones’: Winter Is Coming While Westeros Smoulders If we have learned anything from Westeros over its first two seasons, it is that no action, however big or small, is independent of the others surrounding it. Actions have consequences, consequences begat actions, etc. ... And as we saw in ...", "From Downton Abbey to Westeros TORONTO — She had no previous experience wielding weapons or marching through knee-deep snow across frigid glaciers, but 26-year-old Scottish actress Rose Leslie said it felt pretty natural stepping into the role of Ygritte on Game of Thrones. The ...", "'Game of Thrones': How to plan a premiere feast worthy of Westeros The Season 3 premiere of \"Game of Thrones\" is only days away, but it's not too late to plan a delicious feast for the event. Food is a big part of the world of \"A Song of Ice and Fire,\" and it's always nice to tie that part of the series into ...", "Women of Westeros attend 'Game of Thrones' premiere (Photos) \"Game of Thrones\" returns for a third season on HBO on March 31, 2013. The cast of \"Game of Thrones\" paraded on the red carpet at the series premiere in Hollywood on March 18, 2013. Game of Thrones fantasy series returns for third season on HBO The women ...", "Game of Thrones season 3: Westeros woes for Tyrion Joining the cast for season three is British acting legend Dame Diana Rigg. She will play Lady Olenna Tyrell (aka The Queen Of Thorns). Dame Diana Rigg is best known for playing Emma Peel in 1960s drama The Avengers. She also starred in Bond movie, On Her ...", "Game of Thrones' Michelle Fairley talks Catelyn Stark, Westeros and women SEX, violence, nudity and an R18+ rating have brought controversy to the fantasy show Game of Thrones - but that hasn't stopped it being a worldwide hit, nor the most pirated TV show of 2012. \"Look, everybody who watches it is entitled to an opinion, and ...", "The Morality of Tyrion Lannister vs. Ned Stark in Game of Thrones To be sure, if the dense Samwise Gamgee and the softhearted Frodo Baggins were to set off in Westeros—the continent where Martin’s series largely takes place—their tender hobbit hearts would bring them, and most likely everyone around them ...", "The Resurrection of Fandoms “Doctor Who” is shown on BBC and BBC America. The Seven Kingdoms of Westeros returned to audiences Easter Sunday with the season three premiere of the smash-hit, “Game of Thrones.” Nielsen ratings showed that the third season premiere delivered 4 ...", "HBO announces return of 'Game of Thrones' for fourth season after high ratings B. Weiss. The series first aired on HBO in the U.S. on April 17, 2011. The series is based on the fantasy continents of Westeros and Essos, at the end of a 10-year-long summer. Several plot lines take place during the episodes. The civil war for ...", "You know nothing Jon Snow I’m going to forego my kneejerk cynical comment on Westeros weddings and just say that this is pretty freaking cute. Nerd love is the best love. Note: There’s a 30-second commercial before the good stuff starts. Go check your Tumblr inbox or something.", "HBO announces return of 'Game of Thrones' for fourth season after high ratings B. Weiss. The series first aired on HBO in the U.S. on April 17, 2011. The series is based on the fantasy continents of Westeros and Essos, at the end of a 10-year-long summer. Several plot lines take place during the episodes. The civil war for ...", "You know nothing Jon Snow I’m going to forego my kneejerk cynical comment on Westeros weddings and just say that this is pretty freaking cute. Nerd love is the best love. Note: There’s a 30-second commercial before the good stuff starts. Go check your Tumblr inbox or something.", "proposals I’m going to forego my kneejerk cynical comment on Westeros weddings and just say that this is pretty freaking cute. Nerd love is the best love. Note: There’s a 30-second commercial before the good stuff starts. Go check your Tumblr inbox or something.", "Dress like your favourite gal in ‘Game of Thrones’ (part 1) Though Canadians are finally starting to feel spring – and winter has most definitely come to Westeros – we thought it would be fun to share this little guide to dressing like your favourite femme badass*. *Here’s hoping Sensa Stark steps ...", "Mad Men’s Calgary woman, Semi Chellas, talks about writing for TV’s best drama It was more effective than when Lena Dunham went all dominatrix on her jerk-off ex-boyfriend in the irreverent comedy-drama Girls, or any of the perverse and violent moments surrounding the feuding, occasionally incestuous families of Westeros ...", "TV Ratings: 'The Voice' gives 'New Normal' a finale bump as NBC splits Tuesday \"The Voice\" dominated the 8 p.m. hour on Tuesday night and also gave \"The New Normal\" its best ratings since October, though CBS repeats still ended up leading primetime overall. Among other Tuesday notables, ABC's \"Splash\" continued a steady ratings ...", "Michael Jackson’s doctor sings bizarre jailhouse serenade to Anderson Cooper In what could charitably be termed an unusual PR move, Dr. Conrad Murray, Michael Jackson’s former personal physician, sang a song to CNN’s Anderson Cooper during a telephone interview Tuesday. Murray, who is currently serving a five year ...", "'Glee' Finale Without Cory Monteith Won't Be What Fans Expected The news that Glee star Cory Monteith had entered rehab for substance abuse may not have surprised fans familiar with his past, but that doesn't mean they don't have questions. Like what the heck is going to happen to the show without one of their leading ...", "‘Game of Thrones’ Inspires Cookbook The series based on the best-selling novels by George R. R. Martin, is a violently epic medieval fantasy about warring families, vying for power over the mythical land of Westeros. But in between the bloody battles and palace intrigue ...", "Game Of Thrones Season 3, Episode 2: A Look At Dark Wings, Dark Words It looks like next week's Game of Thrones continues the series' first half of the season strategy of introducing new faces and welcoming back old favorites while only advancing the plot ever so slightly. The preview for \"Dark Wings, Dark Words ...", "10 Life Lessons I’ve Learned From Country Music I’m moving to Nashville in 10 days, so obviously I’ve been listening to a lot of country music. I’ve discussed the many merits of country before, but recently I’ve discovered how many bits of wisdom are written into these twangy songs ...", "Game Of Thrones Series Four To Be Filmed In NI Based on the bestselling fantasy book series by George R R Martin, the drama series chronicles a myriad of power struggles in the fictional continents of Westeros and Essos. A court has named Spain's Princess Cristina as a suspect in a corruption case ...", "Film critic Ebert says cancer returns, plans 'leave of presence' while undergoing radiation In a blog post, the 70-year-old said he'll take a \"leave of presence.\" The veteran critic has previously battled cancer in his thyroid and salivary glands and lost the ability to speak and eat after surgery. In a lengthy essay posted late Tuesday, Ebert ...", "TV: 'Game Of Thrones' gets even more brutal in Season 3 It's a key chunk of an ultra-complex, sprawling saga about power-hungry families vying to control the seven kingdoms of Westeros. But don't expect your jaw to hit the floor right away. The first two episodes, of the four made available for ...", "If you can't get enough 'Game of Thrones,' you can fawn over fan art Your epic \"Game of Thrones\" fantasy world just got a little bit more real, thanks to the \"Game of Thrones\" exhibition, a fan’s wet dream that will travel to cities around the globe offering props, an \"immersive experience\" based on the second season's ..."]}, "facebook": {"politics": ["West Michigan lawmakers back GOP leader Dave Agema after anti-gay Facebook post GRAND RAPIDS, MI — Two West Michigan lawmakers are backing Dave Agema, the Michigan Republican leader whose controversial anti-gay Facebook post last week opened a rift among the state's GOP faithful. Republican state Reps. Ken Yonker, of Caledonia, and ...", "Sheryl Sandberg, Facebook exec, seen laying groundwork for life in politics Sheryl Sandberg, fresh off a media tour to promote her book on women in the workplace, is building the foundation for a life in the public eye that supersedes her day-to-day duties as operating chief at Facebook Inc. Summers's former cabinet ...", "Facebook War: Blue Crosses Fight Red Equal Signs It is a battle of red vs. blue all over again, this time waged on Facebook with profile images. I was surprised to read in the Marietta Daily Journal that students at one high school in Cobb County, Ga., are posting blue Christian cross signs as ...", "Israel's Facebook politician finds that new media comes with a price Economic policy is complicated stuff. Explaining its rationale to those who don’t come naturally to number crunching can be a formidable task. So can convincing those challenged by charts and graphs that what’s going to pinch, sting and even downright ...", "Lapid on Facebook: Direct message or distraction Experts weigh in on the new Finance Minister's use of social media to get his message across while working on the new budget. Several days have passed since Finance Minister Yair Lapid posted his much-discussed \"Ricki Cohen\" status on Facebook, but social ...", "Facebook founder Mark Zuckerberg seeking bigger voice in public issues After building the world's leading online social network, taking his company public and cementing his position as one of the wealthiest 20-somethings on the planet, Facebook's Mark Zuckerberg is increasingly showing signs that he wants to ...", "Kenya: Twitter, Facebook Awash With Uhuru Messages Nairobi Kenya — The social media has been awash with mixed reactions on the Supreme Court decision that upheld the declaration of the Independent Electoral and Boundaries Commission on Uhuru Kenyatta as the president-elect. The reactions followed a ...", "Why Facebook matters in the fight for gay marriage If you've been on Facebook in the past week, you've probably seen it: the red equals sign. Human Rights Campaign launched the movement last Monday, as the Supreme Court moved towards a ruling on Prop 8. According to Facebook ... I tweeted my appreciation ...", "Mark Zuckerberg’s Childhood Website Was Slightly Uglier Than Facebook A commenter on Hacker News pulled this gem out of the bowels of the Internet today. It's a personal website that appears to have been created by Facebook tycoon Mark Zuckerberg, who was then a high-school freshman, on Angelfire in about 1999. We don't know ...", "Facebook somehow sinks to a new low Look, I get it Facebook, you need money. You do targeted ads. This does not mean it is okay for you to use my information to advertise a church that preaches hate towards gay people to me, a gay Buddhist. I wish I knew what else to write here ...", "Facebook’s marriage equality map is data ‘well worth finding’ This week, Facebook users were urged to substitute their profile picture for a simple graphic designed by the Human Rights Campaign. The goal is to demonstrate widespread support for marriage equality with two high-profile cases getting underway ...", "Facebook's Zuckerberg plans ambitious legislative agenda SAN FRANCISCO — For years, Silicon Valley companies wanted as little to do with Washington as possible. Hiring lobbyists to promote and protect their interests was about as far as they went. But a new generation of technology entrepreneurs ...", "Marriage Equality Campaign Causes 120% Increase in Facebook Pic Swaps If you thought you were seeing all your Facebook friends swap their photos to red equality signs Tuesday, you were right. Facebook reported a 120% increase in profile picture swaps, as compared to an average day. According to a post from ...", "New Facebook, Twitter rules for New York cops NEW YORK: New York City's police commissioner announced new restrictions for cops who want to tweet and post on Facebook. Police will not be allowed to specify their jobs on YouTube, Facebook and other Internet platforms, NY1 television and the ...", "State Republican official won't resign over antigay Facebook post LANSING -- A prominent Michigan Republican was not backing down or apologizing Thursday as he faced calls for his resignation over an antigay posting on his Facebook page. Republican national committeeman Dave Agema's post Wednesday, during U.S ...", "New Facebook, Twitter rules for New York cops NEW YORK: New York City's police commissioner announced new restrictions for cops who want to tweet and post on Facebook. Police will not be allowed to specify their jobs on YouTube, Facebook and other Internet platforms, NY1 television and the ...", "State Republican official won't resign over antigay Facebook post LANSING -- A prominent Michigan Republican was not backing down or apologizing Thursday as he faced calls for his resignation over an antigay posting on his Facebook page. Republican national committeeman Dave Agema's post Wednesday, during U.S ...", "Former candidate Protack shuts down Facebook page After weeks of mean-spirited postings, Mike Protack’s Facebook account is down. Protack, who has run for political office multiple times but has not won a seat, adamantly denied posting the statements. The Republican didn’t deny he had a ...", "Mich. RNC member: I won't resign for Facebook post LANSING, Mich. (AP) — A Michigan member of the Republican National Committee said Thursday he will not resign after posting an article critical of gay people on his Facebook page, despite calls from members of his own party that he step down.", "What's Behind Criticisms of Those Red Equal Signs in Your Facebook Feed? What in the world could be wrong with it? It's been all over Facebook and Twitter as part of a wider social media campaign for marriage equality. If you're especially savvy, you're aware that it's a spin on the Human Rights Campaign's logo (which they've ...", "New York cops get strict new rules for Facebook New York City’s police commissioner announced new restrictions Thursday for cops who want to tweet and post on Facebook. Police will not be allowed to specify their jobs on YouTube, Facebook and other Internet platforms, NY1 television and the ...", "Zuckerberg Tax: Facebook CEO to Pay $1.1 Billion, Report Says Facebook CEO Mark Zuckerberg will likely have to pay more than $1 billion in taxes, according to a report from CNN on Thursday. CNN Money reported that Zuckerberg, who is worth around $13 billion, will have to pay $1.1 billion for his 2012 taxes likely ...", "GOP Leader ‘Filthy’ Lifestyle of Homosexuals Facebook Post Sparks Controversy GRAND RAPIDS, MI- Dave Agema, a former West Michigan state representative, is sparking national attention after posting “Everyone Should Know These Statistics on Homosexuals” written by Frank Joseph, M.D. on his Facebook page. The article ...", "Facebook vote: Area animal shelters in running for year of free Pedigree dog food Nominations for Pet Rescue North and the Safe Animal Shelter in Middleburg led to Jacksonville's selection as a finalist in the Pedigree Feeding Project: Choose the Next Communities. The pet food company will supply winning shelters with 100 ...", "Local Republicans join call for Dave Agema's resignation after anti-gay Facebook post A group of 21 young Republican activists are calling on Republican National Committeeman David Agema to resign in response to an anti-gay post on his Facebook page. \"This isn't about what we believe either politically or as women and men of ...", "Michigan RNC's Agema defends Facebook post on gays Michigan's Republican National Committeeman Dave Agema stood by a controversial anti-gay social media posting Thursday even as some members of his own party called for his resignation. A group of 21 young Republican activists released a letter ...", "Facebook's Frank Gehry campus gets Menlo Park approval Facebook's Frank Gehry-designed campus plans got the office stamp (like?) of approval from Menlo Park's City Council, which approved the new campus in a 4-0 vote. The city and Facebook have been working out the deal for the 433,555-square-foot ...", "Facebook’s Zuckerberg forming political group, source says A person familiar with Facebook Inc. said CEO Mark Zuckerberg is forming a political group to address issues such as education reform, immigration and scientific research. The person said the group will formally launch in the coming weeks.", "Source: Facebook’s Zuckerberg forming political group NEW YORK (AP) — A person familiar with Facebook says CEO Mark Zuckerberg is forming a political group to address issues such as education reform, immigration and scientific research. The person says the group will formally launch in the coming ...", "RNC Chair Urges “Dignity and Respect” for All After Michigan GOP Official’s Facebook Post On “Filthy” Homosexuals The Republican National Committee did little Thursday to quell the uproar over a controversial Facebook posting by committeeman Dave Agema of Michigan on “filthy” homosexuals that has prompted calls for his resignation or removal from the ..."], "business": ["Biz Break: Tesla dives amid doubts; Apple, Zynga and Facebook gain of profitability and hype about an impending announcement, but doubts about both events led to shares plunging back down Wednesday. Tesla stock dove as much as 9.4 percent Wednesday before closing with a 7.3 percent decline at $41.10, a drastic ...", "Facebook password amendment removed from Washington Legislature bill SEATTLE -- An amendment that would have allowed bosses to ask for a worker's Facebook or other social media password during company investigations was withdrawn on Wednesday from a bill in the Legislature. However, House lawmakers said they will ...", "Wash. bill to allow employer access to Facebook passwords rejected SEATTLE (AP) - An amendment that would have allowed bosses to ask for a worker's Facebook or other social media password during company investigations was withdrawn on Wednesday from a bill in the Legislature. However, House lawmakers said they ...", "Quartz Daily Brief—Asia Edition—Global central bank rodeo, Facebook’s phone, Dangerous tourism It’s central bank day, as the world’s setters of monetary policy struggle to keep ahead of a soft global economy: Facebook unveils something, probably a phone. If you don’t understand why anyone would buy a Facebook phone, you probably don’t ...", "Provision to allow bosses access to Facebook passwords dropped SEATTLE -- An amendment that would have allowed bosses to ask for a worker's Facebook or other social media password during company investigations has been withdrawn for now. The provision was proposed on Tuesday for a Senate bill that ...", "WA House OKs Safeguarding Facebook Passwords SEATTLE, Wash. - Employees in the state do not have to worry about their boss asking for social media passwords, for now. The House Labor and Workforce Development Committee withdrew the amendment Wednesday. The amendment would have allowed bosses to ask ...", "Gates, Facebook Staging \"Hackathons\" on Education \"Hackathons,\" collaborative and often competitive events designed to challenge programmers and developers to come up with new technologies and ideas around specific goals or themes, have gained traction in the public and private sector as a way ...", "State House panel OKs safeguarding Facebook password SEATTLE -- An amendment that would have allowed bosses to ask for a worker's Facebook or other social media password during company investigations has been withdrawn for now. The provision was proposed on Tuesday for a Senate bill that ...", "Netflix leads tech slump; Zynga, Facebook jump SAN FRANCISCO (MarketWatch) -- Tech stocks put in a generally negative trading session Wednesday, mirroring the performance of the broader market, with Netflix Inc. (NFLX) among the day's notable decliners. The overall market slumped early, and closed in ...", "SEC Approves Corporate Announcements Via Facebook, Twitter, LinkedIn The Security and Exchange Commission (SEC) has for companies to make corporate announcements via Facebook, Twitter, and LinkedIn. However, there's a caveat: Companies must inform investors beforehand of the URLs where announcements will be made.", "Facebook's new home on Android: Join us Thursday (live blog) After years of the rumor mill churning out reports of a Facebook phone, the social network may actually deliver something at its press event tomorrow. Facebook set off a fresh round of speculation -- despite CEO Mark Zuckerberg's repeated denial ...", "Facebook's new home on Android: Join us Thursday, 10 a.m. PT (live blog) After years of the rumor mill churning out reports of a Facebook phone, the social network may actually deliver something at its press event tomorrow. Facebook set off a fresh round of speculation -- despite CEO Mark Zuckerberg's repeated denial ...", "Regulators approve use of Facebook, Twitter for corporate disclosure With the popularity that Twitter continues to enjoy in the world of social media, it makes sense that Wall Street executives would start to use the outlet for sending out company news, and that practice is likely to gain steam after the SEC gave this sort ...", "Dad Sets Up 13-Year-Old Daughter’s Facebook Perv In A Sting Operation Martin began monitoring his daughter’s Facebook page and reading over her posts when he suddenly stumbled across a male adult who seemed to have taken a liking to his little girl. As Martin perused the back and forth cyber banter between his daughter ...", "Sandberg Seen Laying Groundwork for Role After Facebook Sheryl Sandberg, fresh off a media tour to promote her book on women in the workplace, is building the foundation for a life in the public eye that supersedes her day-to-day duties as operating chief at Facebook Inc. (FB) While Sandberg, 43 ...", "SEC’s ruling won’t make many Facebook friends The digerati are having fun with the Securities and Exchange Commission’s ruling that US companies can use social media to distribute market-sensitive information such as earnings reports. “Facebook Flap Forces SEC Into 21st Century,” says ...", "HotelTravel.com Partners with Phuket Resorts to Launch Facebook Sweepstakes -- HotelTravel.com, a worldwide leader in online hotel reservations and part of MakeMyTrip Limited (NASDAQ: MMYT), is celebrating reaching 50,000 fans with a special sweepstake available exclusively through Facebook with free nights at Phuket beach hotels.", "Government warns ‘lives may be lost’ if Facebook medical advice is ignored The Department of Health has warned that lives may be at risk due to the large number of people failing to repost medical information posted on Facebook by friends. “Not enough people are pressing the ‘Like’ button on these amazing medical ...", "Facebook Inc (FB) and Twitter, Inc. Rewrite the Rules for Investors After setting another record high yesterday, stocks are moderately lower this morning, with the S&P 500 (INDEXSP:.INX) and the narrower, price-weighted Dow Jones Industrial Average 2 Minute (INDEXDJX:.DJI) down 0.46% and 0.32%, respectively, as ...", "Moontoast and BLiNQ Media Team up to Boost Social Advertising Innovation and ROI on Facebook NASHVILLE, TN and BOSTON, MA--(Marketwired - Apr 3, 2013) - Moontoast, an innovative Social Rich Media advertising platform leader, announced today a new collaboration with BLiNQ Media, a global leader of Social Engagem ... CBS Local Digital Media is ...", "Cheer Up, Facebook Investors! Maybe People Aren't Bailing On Mark Zuckerberg, After All You can find plenty of anecdotes about people who have bailed on the social network, or are at least spending a lot less time there, sometimes because they’re using rivals like Twitter, Whatsapp or Snapchat, and sometimes because th ... The US Securities ...", "In the news: JC Penney CEO pay slashed, MagicJack earnings top estimates, Facebook to face 'timeline' suit Headlines for Wednesday morning include a sharp pay cut for J.C. Penney's CEO, RBS shareholders suing the company, Exxon receiving a regulatory order related to an Arkansas pipeline rupture, MagicJack beating earnings estimates and a new CEO for Accretive ...", "US SEC Declares Firms may announce Key Data on Twitter, Facebook Inc (NASDAQ:FB) And Other Social Media U.S. regulators declared that firms could use Twitter, Facebook Inc (NASDAQ:FB) and other social media to create key declarations providing they tell investors which sites they will employ, an attempt to help firms navigate the new media age.", "Sandberg Seen Laying Groundwork for Role After Facebook: Tech Sheryl Sandberg, fresh off a media tour to promote her book on women in the workplace, is building the foundation for a life in the public eye that supersedes her day-to-day duties as operating chief at Facebook Inc. (FB) While Sandberg, 43 ...", "Bill would allow bosses to get Facebook passwords SEATTLE (AP) -- A new provision could allow employers to ask for a worker's Facebook or other social media password during company investigations. The provision is a proposed amendment for a bill that bars employers from asking for social media ...", "Is this Facebook's new phone? An image of what appears to be the long-rumoured Facebook phone has been published by Twitter account @evleaks. Facebook has scheduled a press event later this week where the company is widely expected to unveil a smartphone built entirely ...", "SEC to allow Twitter, Facebook announcments WASHINGTON - The Securities and Exchange Commission will allow public companies to make significant announcements on Facebook, Twitter and other social media sites provided they alert investors which sites they intend to use. The decision announced Tuesday ...", "With tweets and Facebook 'likes,' BECU creates an old-school ad campaign BECU is turning to old media to highlight what people are saying about the Tukwila-based credit union on social media like Facebook and Twitter. That’s the core of a new campaign BECU launched Monday on TV, radio and billboards in the greater ...", "Apple Rots Anew, Facebook Fails Test, Gold Holds Luster Wells Fargo (WFC) ignited on March 15, then the stock is saw a controlled pull-back into its 21-day moving average, where it found some support last week. The longer it holds above this short-term key moving average, the higher probability we ...", "Facebook Founder Mark Zuckerberg Owes $1 Billion In Taxes Facebook founder and CEO Mark Zuckerberg will have to write a check for about $1 billion when he files his 2012 tax return. The huge bill owed to the IRS and the state of California stems from Facebook going public last May during which ..."], "entertainment": ["Kira Trevino missing: Police seek access to husband's Facebook account A friend of Jeffery Trevino told police that Trevino had recently included the initials NWNP on Facebook posts, and that they may mean \"No Witnesses No Proof,\" a search warrant affidavit said. The affidavit, made public Wednesday, April 3, was ...", "Facebook Photo Project ‘Are You Really My Friend?’ Creator on Her Progress & Idea Being Stolen [INTERVIEW] Last we left off with Tanja Hollander in early 2012, Hollander was well on her way to making a name for herself and her art project “Are You Really My Friend?” The photography project is centered around the goal of Hollander photographing each of her ...", "ASUNCIÓN, Paraguay (BP) -- Steven Kunkel's nickname appears at the top of his Facebook page: Sugoi (pronounced sue-GOY) means \"awesome\" in Japanese. \"Sugoi is my catchphrase,\" Steven explains, \"so sometimes my friends call me 'Sugoisteve.'\" But from Steven's perspective, the \"sugoi\" part isn't about him. It's about God. \"I always want ...", "Character Posters for “The Great Gatsby” Released on Facebook In Preparation for New Trailer We are just a mere 4 weeks away from the release of director Baz Luhrmann’s adaptation of the 1925 F. Scott Fitzgerald novel The Great Gatsby starring Leonardo Di Caprio, Carrey Mulligan and Tobey Maguire. Leading up to the new trailer being ...", "With New Facebook Phone, Mark Zuckerberg Is One Step Closer to World Domination If the Internet rumor mill is right, the Facebook phone will launch on Thursday. Here are seven reasons this is ridiculous. By Winston Ross. SHOCKINGLY BOLD PREDICTION: Once the crazily anticipated “Facebook Phone” does or does not get ...", "Ask B. Smyth YOUR Questions During Our Live Facebook Interview! A lot of people cover songs on YouTube and because so many people do this, a good portion of them end up being… not so great. An exception to that trend is B. Smyth, an up-and-coming R&B singer who we’re giving you the chance to chat with ...", "‘Seeing the Bully Finally Meet His Demise is Just Sad’—Michael Arrington’s Former Partner Denounces Him on Facebook Facebook hasn't been kind to Facebook investor and TechCrunch founder Michael Arrington lately. The notorious tech thug was accused by his ex-girlfriend Jenn Allen of physical abuse and death threats in a Facebook post last week, as we were the ...", "Maci Bookout Plans to Announce Engagement on Facebook and Twitter! Maci Bookout sent fans into a swoon-induced frenzy after she took to Twitter with an acute case of wedding fever. The Teen Mom star has been dating boyfriend, Taylor McKinney, for months now, which is basically a lifetime in Teen Mom land. Not only are ...", "Facebook's COO on reigniting a workplace revolution Sheryl Sandberg, who became Facebook’s Chief Operating Officer in 2008, recently took on the role as outspoken advocate for women aspiring to leadership positions. Her new book, Lean In — which she describes as “sort of a feminist manifesto” — is ...", "As Facebook matures, is it less fun? To see what Facebook has become, look no further than the Hutzler 571 Banana Slicer. Sometime last year, people began sharing tongue-in-cheek online reviews of the banana-shaped piece of yellow plastic with ... Recently, on a grey, wintery day sequestered ...", "Napster Founder/Facebook Co-founder Sean Parker Nixes Rumor About Medieval Wedding When word leaked out about Sean Parker’s wedding, the Web was abuzz with rumors of the ultimate geek nuptials. The tech billionaire — Napster founder, Facebook co-founder and Spotify investor — and his fiancé Alexandra Lenas were ...", "Facebook Co-Founder Sean Parker Throwing A Medieval Themed Wedding Sean Parker, Facebook co-founder, is getting married to his fiancé Alexandra Lenas in June, and their wedding is going to be a medieval-themed costume party. The wedding is set for June 1 in Big Sur, California. One source told the New York ...", "Facebook Co-Founder's 'Game of Thrones'-Themed Wedding Sounds Crazy Cool Billionaire tech entrepreneur Sean Parker's been on a pretty wild ride since he created Napster in the late '90s, co-founded Facebook with Mark Zuckerberg, and was even portrayed by Justin Timberlake in The Social Network. But it sounds like his upcoming ...", "Meet The Gorgeous Musician Who's Engaged To Facebook Billionaire Sean Parker After a two-year engagement, Alexandra Lenas and Sean Parker will get married on June 1 in Big Sur, California. Last year they had a child together, Winter Victoria Parker. The theme for the wedding is Medieval, according to the New York Post. Who is ...", "Boston Police Reportedly Posing Undercover On Facebook To Scout Out Illegal Punk Rock Shows One of the ways for bands and musicians to interact with fans and to let them know where their next concert is, or when their next album is coming out, would be through social media sites such as Facebook or Twitter. However it also seems that that is ...", "During Lent, area Christians gave up meat, coffee, Facebook Kun Il Lee and his wife, Chang Lee, foreground from left, attend a 5:45 a.m. service at Tacoma First Baptist Church last week. The congregation was encouraged to attend the early morning services, Mondays through Saturdays . (JANET JENSEN/STAFF ...", "Dave Agema, Michigan Republican National Committeeman, Posts More Anti-Gay Remarks On Facebook Less than one week after posting a controversial article condemning the “filthy” lifestyle of “homosexuals,” Michigan Republican Dave Agema has once again taken to Facebook to voice his opinion on the LGBT community, warning his ...", "The Taco Bell Facebook Post That Better Not Be A Joke Mmmkay folks, so Taco Bell posted this photo (below) on their official Facebook page, with the following text: “Back this May. No joke.” The photo features the much-missed Beefy Crunch Burrito — a tortilla stuffed with Fritos Flamin’ Hot ...", "A Death on Facebook The most jarring experiences that I remember from my youth were the early morning phone calls. I would hear my father scurrying to get the phone. I would shut my eyes tight, knowing that it couldn't be good news. I'd hear a muffled \"Oh no...,\" followed by ...", "Potter looked to Facebook for 'Ginger and Rosa' leads BRITISH director Sally Potter is one of the movies' leading experimentalists and early adopters - she once shot a feature on an iPhone. And for her new movie, \"Ginger and Rosa,\" she solicited auditions online, via Facebook. She received 2,000 ...", "Deepti Naval upset with media, slams it on Facebook, Twitter Bollywood actress Deepti Naval is upset with media for publishing a wrong information about an incident at her place. She took to Twitter and Facebook to criticise it and urge people to support her. The actress had some differences with her ...", "Facebook fights page creator: I want Bridgewater-Raritan school to see fights are a problem BRIDGEWATER — The creator of a Facebook page that once hosted videos of students fighting at Bridgewater-Raritan High School says the goal was to stop fights from happening at the school. \"Thank you everyone who viewed this page or spread the news about ...", "Red equal-signs posted by Beyonce, Fergie, and True Blood on Facebook walls (Video) Paula Deen was represented, although we did not find it on her Facebook wall, the variation of the red equal sign was Paula sitting on two sticks of butter with the quote, \"It's like two sticks of butter, y'all.\" Political celebrities such as Hilary ...", "The story behind the gay marriage symbol taking over Facebook How a red square with a pink equal sign became the new icon for marriage equality You've probably already seen it on Facebook or Twitter: Two parallel pink lines splashed on a red square background, appearing where your friends' selfies usually go.", "Whitney Houston's sister-in-law scares family with Facebook post Whitney Houston's sister-in-law and manager sparked a family suicide scare in Georgia on Tuesday when she posted what appeared to be a desperate message on her Facebook.com page, turned off her cellphone and went to sleep. TMZ.com reports Pat Houston's ...", "In support of Facebook’s sea of red for equality The rainbow has gone in a decidedly more monochromatic direction. If you’ve been on Facebook this week — and you’re not on the staff of the National Review — chances are you’ve already noticed. As the black-robed Supreme Court weighs ...", "People Who Hate TV Show Spoilers on Facebook Want to Ruin It for the Rest of Us Like many of you, I was EVER so excited about watching the Downton Abbey season finale. And I was just as excited about talking about that finale with my friends. But no sooner did I put out the call on Facebook (\"OMG, Downton finale -- who's watching?", "Whitney Houston - Whitney Houston's Ex-manager Sparks Suicide Scare With Facebook Post Tmz.com reports Pat Houston's friends and family grew concerned when they couldn't reach her after reading what they feared was her final post - and called the police. Houston, who is married to the late singer's brother Gary, wrote: \"Sometimes you just ...", "The Crucial Mistake Most Bands Are Making With Facebook Are you a musician? Is your group having issues? Ask Fan Landers! Critic Jessica Hopper has played in and managed bands, toured internationally, booked shows, produced records, worked as a publicist, and is the author of The Girls' Guide to Rocking, a how ...", "Bristol Lounge wants Facebook fans to create new signature martini The Bristol Lounge at the Four Seasons Boston is looking to spruce up its cocktail menu. The search for a new signature martini is on, and the Bristol is taking to social media for the drink of choice If you make a mean martini, The Bristol Lounge Bar ..."]}, "apple": {"politics": ["HOW MARCO RUBIO PLANS to sell immigration reform to right -- WHCA winners: Lizza, Pace, Moran, CPI -- Dr. Feldman, Meridith Webster, Brent Colburn b'day FIRST LOOK – Ed Henry, president of the White House Correspondents’ Association, will announce today : “Ryan Lizza of The New Yorker is this year’s winner of the White House Correspondents’ Association award for journalistic excellence … Julie ...", "Apple apologizes in China after service criticism CHARLESTON — Voters will decide Tuesday whether to help former Gov. Mark Sanford in his quest for political redemption or to make former Charleston County Councilman Curtis Bostic the GOP nominee for an open South Carolina congressional seat ...", "Gays hate apple pie! A Kansas congressman writes the dumbest anti-gay marriage op-ed ever Please, please say that this was your version of an April Fool’s day gag, Tim Huelskamp. Please say this was your Onion-like parody of the absurd, hyperbolic bluster which makes the opponents of marriage equality seem so dumb and silly.", "Analyst: 60-inch Apple iTV to launch this year Connecticut lawmakers are expected to pass a package of gun control and other measures they believe are some of the most comprehensive in the country following the Newtown school massacre. Responding to one of the worst massacres in state hist ..", "ICYMI: Apple's ho-hum environmental report, greener Easter goods, and more Happy almost-April-Fools-Day, readers! The arrival of April means that the much-dreaded Earth Day Onslaught is nigh -- we're still trying to come to terms with how we'll come to terms with the flood of announcements next month, but in the ...", "Gillibrand/Owens reintroduce legislation aimed at increasing NY apple exports U.S. Sen. Kirsten Gillibrand, D-N.Y., and Rep. Bill Owens, D-Plattbsburgh, announced they have reintroduced legislation in their respective houses to streamline the exporting of apples to Canada by eliminating an inspection on the U.S. side of the border.", "[Pics] Nostalgic Moments Of Steve Jobs Returning Back To Apple In 1996 Steve Jobs once said that getting fired from Apple was the best thing that could have happened to him, it made him rethink about himself and recreate things that he could not have done staying at Apple. But one iconic day in the history of Apple ...", "Will This Tech Giant Launch a Smart TV Before Apple? While most people following the race to release a smart TV are looking to Apple, Google, or Samsung, in this video, Motley Fool tech and telecom analyst Andrew Tonner tells investors about one unexpected tech giant making a big push to get there ...", "Catherine Apple Williams Catherine Apple Williams, 87, of Fuquay-Varina passed on March 24, 2013. Catherine was a long time resident of Wake County; granddaughter to the late Walter Hill Aiken, the first elected mayor of Fuquay-Springs, now Fuquay-Varina; and worked for ...", "Don't Get Too Excited on Apple (AAPL) Given Risks of Near-Term 'Miss' - Oppenheimer Just as Apple's (NASDAQ: AAPL) stock is starting to get legs again, analysts at Oppenheimer are trying to dampen near-term expectations. Oppenheimer analyst Ittai Kidron lowered his price target Tuesday from $600 to $550 and said he sees risk to near term ...", "Apple corporate/data centers now running on almost pure renewables Yes, I'm aware of Apple's corporate sins: Foxconn labor issues, keeping billions out of the U.S. to avoid paying taxes, etc. But they also deserve props when they do the right thing, and today's a day for some serious props: Apple's Data Centers ...", "Apple's Growing Problem The following video is from Wednesday's MarketFoolery podcast, in which host Chris Hill, along with analysts Matt Argersinger and Andy Cross, discuss the top business and investing stories of the day. There's no doubt that Apple is at the center ...", "John Browett and Apple retail: “rejected for fit rather than competency” Former Dixons Retail CEO John Browett, who enjoyed his position at the top of Apple retail for less than a year, has come forward to discuss some of the reasons why he didn't end up staying at Apple for longer. In an interview during this week's ...", "China vows tough regulation on Apple China’s commerce market watchdog on Thursday pledged to strengthen regulations concerning infringements of customer’s rights, such as the adoption of differentiating repair policies by Apple. The State Administration for Industry and Commerce said it ...", "Police officer reports his son over £3,700 Apple debt on iPad games A policeman has shopped his 13-year-old son for fraud after he ran up a £3,700 bill – playing iPad games. PC Doug Crossan, 48, was horrified when his credit card company informed him that son Cameron had blown a small fortune in the App Store.", "China vows tough regulation on Apple China’s commerce market watchdog on Thursday pledged to strengthen regulations concerning infringements of customer’s rights, such as the adoption of differentiating repair policies by Apple. The State Administration for Industry and Commerce said it ...", "Police officer reports his son over £3,700 Apple debt on iPad games A policeman has shopped his 13-year-old son for fraud after he ran up a £3,700 bill – playing iPad games. PC Doug Crossan, 48, was horrified when his credit card company informed him that son Cameron had blown a small fortune in the App Store.", "Shooting drill prepares students, rattles neighbors APPLE VALLEY • A local middle school was placed on a mock lockdown Wednesday afternoon as students and staff learned how to prepare for school shooting or other emergency. But some people in the neighborhood thought the drill was real. The campus of ...", "What Imee disclosed and didn’t MANILA, Philippines - In 10 out of the 13 Statements of Assets, Liabilities, and Net Worth (SALN) that she filed as member of Congress from June 1998 to June 2007, Ma. Imelda ‘Imee’ R. Marcos, eldest daughter of the late strongman Ferdinand ...", "Race Is On for High-Skilled Tech Visas The urgent race for such visas -- highly desired by Microsoft, Apple, Google and other leading technology companies -- coincides with congressional plans to increase the number available to tech-savvy foreigners. The race to secure one of the 85,000 so ...", "Bribery scandal leads to call for new Queens Republican leadership Ulrich also called this week for GOP mayoral candidate John Catsimatidis to suspend his campaign for mayor. Catsimatidis’ company, Red Apple Group, employed Tabone as its lawyer and in a statement, Catsimatidis said he was made aware of the investigation ...", "Religious groups, pro-reform organizations brace for fight over family-based visas “This is the first inning of a nine-inning game,” Appleby said. “We will have many bites of the apple.”", "Op-ed: 'Powerless' claim of gay-marriage advocates is a sham including Apple, Estee Lauder, Facebook, Nike, Tiffany & Co. and Xerox.\" And beyond all the political, moral and financial support, those in favor of redefining marriage were victorious at the ballot box in four states in November, further ...", "Texas House names pecan pie state's official pie One of Farney's colleagues razzed: \"Do you have a recipe?\" Another wanted to know if she was saying \"too bad to the apple pie,\" which some say is America's official pie. They also asked for amendments that only Texas pecans be used in pecan pies ...", "Air show lobbyists to buzz Capitol Hill \"It's never been necessary for us to hire a lobbyist. It's a pretty mom-and-apple-pie industry,\" Cudahy said. \"But we have to do this now.\" Van Scoyoc Associates is being retained on a month-to-month contract, Cudahy added. In a message to ...", "The votes are in and the pies have it One of Farney's colleagues razzed: \"Do you have a recipe?\" Another wanted to know if she was saying \"too bad to the apple pie,\" which some say is America's official pie. They also asked for amendments that only Texas pecans be used in pecan pies ...", "GOP's Joe Lhota And Daniel Isaacs Speak Out On Malcolm Smith Bribe Plot Complaint Tabone has been fired from the mayoral campaign of Lhota rival John Catsimatidis and suspended without pay from his lawyer job at the candidate's private business, Red Apple Group. Catsimatidis furrowed some brows yesterday with his argument that the Smith ...", "Lawmaker Accused Of Bribes In Nyc Mayor Race Plot They were both arrested Tuesday. Tabone is a lawyer for Catsimatidis’ Red Apple Group, which owns the Gristedes supermarket chain and other businesses, and Tabone has been a consultant to Catsimatidis’ campaign. Campaign finance records show ...", "Binays: Nothing wrong with 4 of us in gov’t MANILA, Philippines – A senator, a congresswoman, a mayor, and the country’s vice president will likely share one last name after the May polls: Binay. Still, Makati’s political family is unapologetic for fielding 3 candidates. The ...", "\" Nationwide GOP Voter Registration Fraud Scandal Widens, Becomes Criminal Matter in Florida \" Now that \"suspicious and possibly fraudulent voter registration forms\" turned in by the Republican Party and Sproul have been found in \"at least 11 counties\" in Florida, as reported by the Los Angeles Times on Saturday, their \"one bad apple\" talking point ..."], "business": ["What's behind Apple's mea culpa in China? Apple CEO Tim Cook's overboard apology to China about the company's alleged disregard of customer service highlights an East-West cultural clash about how to do business. It's a sundry tale chock full of seedy copycats and scammers, a secretive ...", "Apple Inc. (AAPL), Hewlett-Packard Company (HPQ): Is This Computer Hardware Company Going to Burn These Hedge Funds? Agilysys, Inc. (NASDAQ:AGYS) was in 5 hedge funds' portfolio at the end of December. AGYS investors should pay attention to a decrease in activity from the world's largest hedge funds in recent months. There were 5 hedge funds in our database ...", "Biz Break: Tesla dives amid doubts; Apple, Zynga and Facebook gain of profitability and hype about an impending announcement, but doubts about both events led to shares plunging back down Wednesday. Tesla stock dove as much as 9.4 percent Wednesday before closing with a 7.3 percent decline at $41.10, a drastic ...", "Neither Apple Nor Microsoft Are Buying Netflix Netflix would apparently look good on the arm of Apple or Microsoft. Jim Cramer played up the video service as a potential acquisition target on CNBC's Mad Money show on Monday night. However, instead of going the more common Amazon.com route ...", "U.S. stocks extend slide after disappointing jobs data, Apple bucks trend “U.S. stock losses escalated Wednesday, with the Dow industrials and S&P 500 retreating from record highs, after disappointing labor-market data ahead of Friday’s nonfarm payrolls report,” Kate Gibson reports for MarketWatch. “‘If you ...", "Edu Comp is named certified Apple sales and service provider Apple Corporation recently confirmed a new two-year contract with Edu-Comp to provide the Island community with authorized sales and service of Apple products. Edu-Comp is the only business on Martha's Vineyard with this designation, according ...", "Apple apologizes in China after service criticism BEIJING (AP) -- Apple apologized to Chinese consumers after government media attacked its repair policies for two weeks in a campaign that reeked of economic nationalism. A statement Apple posted in Chinese on its website Monday said the complaints had ...", "Hot Buzzers: Apple Inc, Magnum Hunter Resources Corp, Chevron Corporation Apr 03, 2013 (ACCESSWIRE-TNW via COMTEX) -- NEW YORK, April 03, 2013 -Bestdarnpennystocks.com, one of the leaders in providing investment alerts on U.S. stocks are announcing Investment Highlights on Apple Inc, Magnum Hunter Resources Corp ...", "Microsoft vs. Apple: Retail War (and Free Gym Class Heroes Concert!) Coming to Miami So Microsoft hasn't been cool since Windows 95 went obsolete on December 31, 2001, right? All the hip kids have been buying Macs and MacBooks and Mac OS and iPods and iPads for over a decade. Basically, ever since Steve Jobs (RIP) and company started ...", "Jim Cramer Sarcastically Explains Psych Shift Against Apple Margie is a member of The Motley Fool Blog Network -- entries represent the personal opinion of the blogger and are not formally edited. The headlines I read at various financial centers were, “Cramer calls Apple the JC Penny of Tech ...", "Apple Inc. (AAPL) Option Traders Bet On a Short-Term Move Tech behemoth Apple Inc. (NASDAQ:AAPL - 432.40) is trading modestly higher this afternoon, despite broad-market headwinds. In the options pits, speculators are rushing to bet on AAPL's short-term trajectory, picking up weekly contracts that expire at the ...", "Apple Inc. (AAPL) Uh-Oh: Jim Cramer Sees More Bearishness…Should You Sell? Earlier today, we posted this piece discussing why analysts are over-pessimistic about Apple Inc. (NASDAQ:AAPL). While we talked about some of the finer details of where the company stands and what the future holds, Jim Cramer, in a recent CNBC ...", "Consumer Focus: SSE 'not a case of one bad apple' Consumer Focus has welcomed Ofgem's decision to fine SSE for the \"systemic failure\" in its direct selling operations. This is not a case of one bad apple or one rogue sales team. The problems at SSE affected the whole direct selling operation ...", "Jim Cramer Likens Apple Inc. (AAPL) To JC Penney as Pessimism Grows CNBC’s Jim Cramer compared Apple Inc. (NASDAQ:AAPL) with J.C. Penney Company, Inc. (NYSE:JCP), the struggling department store chain headed by Ron Johnson, the former retail chief from the iPhone and iPad maker. During the program “Squawk on ...", "iPad city: How Apple’s revolutionary tablet is powering London “It could be how you order a drink in the pub or shop for clothes or even how doctors look up medical notes — all that’s needed is an iPad,” Susannah Butter and Andrew Liddle report for The London Evening Standard. “There’s an ...", "Samsung Actually Outspends Apple On Advertising By 400% [Chart[ It’s no secret that Samsung outspends Apple on advertising by a huge margin. Whether those ads are crap or strokes of genius, of course, is a matter of opinion. But dollar for dollar, the truth is clear: Samsung has to spend more money to get its ...", "Apple's Next Big Thing: A New CEO? Sounds crazy now, I know, but so did this riff, alongside Tim Cook-Steve Jobs comparisons, back on Aug. 24, 2012, when AAPL traded around $663, headed for its all-time high of $705.07: Emotion has a fascinating way of working itself into stock ...", "Zynga, Apple Lead Early Tech-sector Gains SAN FRANCISCO – Gains from Zynga Inc. stood out in a mostly upbeat early start for tech stocks Wednesday. The online gaming company's shares climbed 11%, to $3.42 as it debuted two new real-money gambling sites in the United Kingdom.", "U.S. Sen. Charles Schumer proposes reducing tax on hard cider to encourage New York apple growers GRANVILLE — U.S. Sen. Charles Schumer, D-N.Y., plans to introduce legislation that would give the hard cider industry a little extra bubbly. Hard cider sales jumped 24 percent last year, making it the fastest growing alcoholic beverage in the ...", "Apple CEO China Apology For Controversy Over Warranty Policies Apple CEO TIm Cook has issued an apology to its customers in China that addresses the growing controversy over the company’s warranty policies there. The apology was posted of company’s website on Monday and discusses changes to offer better customer ...", "Apple Showing No Signs of a Turnaround Apple is a stock investors want to love, but it is a stock that could cost investors dearly in the future. It is somewhat surprising that a 35 percent drop in a tech giant is spurring excitement among individual investors. It seems that hope is ...", "Report: Apple Inc. (NASDAQ:AAPL) Intends To Release New iPhone This summer Apple Inc. (NASDAQ:AAPL) plans to release next iPhone in summer, before a drop release like the previous two models, according to The Wall Street Journal. The paper declared that Apple Inc. is as well considering to making a cheaper iPhone model ...", "Apple stock off 'preferred' list Goldman Sachs dropped Apple off its list of most highly recommended stocks Tuesday as it joined other analysts in reducing expectations for a company that hasn't had a revolutionary new product since the iPad in 2010. Goldman analyst Bill Shope said the ...", "Apple no longer on Goldman's list of 'preferred' stocks Goldman Sachs has taken Apple off its list of most highly recommended stocks, joining other analysts in dialing back its expectations for the company. Goldman analyst Bill Shope said in a client note that the iPhone 5, introduced last fall, hasn ...", "Stocks to Watch: Tesla, Verizon, Apple Partnering with Wells Fargo (WFC) and U.S. Bank (USB), Tesla said it has created a new kind of financing product \"that combines the surety and comfort of ownership with all the advantages of a traditional lease.\" Wells Fargo and US Bank have ...", "Apple apologises to China BEIJING: Apple Inc. CEO Tim Cook has bowed to pressure from Chinese consumers who demanded an apology over the company's warranty policies in China. Saying the company is sorry for any \"concern or misunderstanding\" in the country. \"We are aware ...", "New apple sparks more interest PULLMAN, Wash. -- The Northwest Nursery Improvement Institute and two other entities have submitted letters of intent to apply to manage the commercialization of a new apple variety being released by Washington State University. The step was not ...", "Goldman Sachs dials back rating for Apple NEW YORK – Goldman Sachs has taken Apple off its list of most highly recommended stocks, joining other analysts in dialing back its expectations for the company. Goldman analyst Bill Shope said in a client note that the iPhone 5, introduced ...", "Apple to Begin Production of iPhone 6, iPhone 5S designed by Steve Jobs? Tech giant Apple is set to begin the production of its upcoming smartphones, dubbed as iPhone 6 and iPhone 5S, for its release on summer. According to sources, Apple already set things in motion for the release of iPhone 6 and iPhone 5S.", "Apple Apology in China a Rite of Passage for Foreign Brands Apple Inc (AAPL). Chief Executive Officer Tim Cook apologized to Chinese consumers after two weeks of being lambasted by state-run media for arrogance and poor customer service. The company’s offense? It failed to replace the back covers of ..."], "entertainment": ["Vintage NYC Magazine Brings Vintage, Modern Flavor to Big Apple On April 13, 2013, models, guests and celebrities will be joining together in celebration of all things vintage and charitable. A portion of the proceeds from the launch party will be donated to “Hope for Javier.” “Our magazine features everything ...", "Feeding the kids: Apple-Cheddar grilled cheese In my ongoing quest to find tasty, kid-friendly food appropriate for the whole family, this week I chose a delicious twist on classic grilled cheese. I found the recipe on Parents.com. Apple-Cheddar Grilled Cheese (makes 4 sandwiches ...", "Roughriders round out Big Apple visit at U.N. NEW YORK — On their last full day in Manhattan on Monday, 110 Port Angeles teenagers were given a look across the world — and a look at their own parts in the struggle for peace. The day's activities began with a tour of the United Nations ...", "Bella Thorne: Big Apple Beauty Looking stylish in the Big Apple, Bella Thorne stepped out for business in the city on Tuesday (April 2). The \"Shake It Up\" star donned a mint pantsuit with a black and white jacket and heels as she strolled along, applying lip balm as she walked.", "Report: Apple to release updated phone this summer NEW YORK (AP) -- Apple is set for a possible summer launch of the next iPhone, rather than a fall launch like the last two models, according to a report Tuesday in The Wall Street Journal. Apple Inc. is also working on a cheaper iPhone model ...", "FIVE INGREDIENT COOKING: An apple a day Preheat oven to 175. Place a medium dish in the oven to warm. Heat a large skillet over medium-high heat. Brush chops lightly with oil and place in hot pan. Cook for 5 to 6 minutes, turning occasionally, or until done. Transfer to the warm dish ...", "Funny or Die releases a teaser trailer for iSteve, its Apple movie If I was casting a film about Steve Jobs’s life, a comic actor probably wouldn’t be my first choice for the title role. But clearly I know nothing about such things. Because first we had Two and a Half Men’s Ashton Kutcher playing the ...", "Stars rock in Dutch Apple's 'Brigadoon' Lerner and Loewe's \"Brigadoon,\" which opened Thursday at the Dutch Apple Dinner Theatre, is the story of a mythical town in Scotland that comes alive for only one day every 100 years. The rest of the time, it's shrouded in the mist, cast under a ...", "Big Apple Circus’ ‘Legendarium’ hits City Hall Plaza For its 35th anniversary season, the Big Apple Circus’s new production, “Legendarium,” is looking back. Way back. As ringmaster John Kennedy Kane informs us, “We’re going to take you back to the origins of the Big Top.” It’s a neat ...", "Hidden treasures: The Apple Miner Colony – When The Morning Comes Home Calling the now defunct New Mexico band The Apple Miner Colony obscure would be putting it politely. Their MySpace page hasn't been logged into for two years (then again, has anyone's?), their Facebook page has less than 500 likes … even ...", "Sienna Miller: Big Apple Stroll with Mama and Beau Flanked by her mom and her man, Sienna Miller stepped out in New York City on Monday (April 1). The \"G.I. Joe: Rise of Cobra\" star was dressed casually in a gray sweater, gray pants, and leopard-print flats as she held mother Jo Miller's hand on one side ...", "Will Apple TV Survive? There are a number of choices you make when it comes to viewing what you want on your television. Along with cable, satellite, and TV boxes, there’s one newcomer that should be considered: Smart TVs. This relatively new technology comes at a price ..", "Golden delicious apple has significant spot in W.Va. history FAIRMONT — It’s West Virginia’s official state fruit. But the golden delicious apple also serves as another slice of the state’s history. The apple variety was discovered by Anderson Mullins in Clay County in 1905 on the family’s farm. Terri ...", "Singing their way to the Big Apple SALEM — Salem High School’s a cappella choir, WitchPitch? will represent the Northeast and compete against high schools from all over the U.S. in three weeks. But first, they’ll perform for the home crowd. WitchPitch? will join Redline, a ...", "The apple of her eye In the 1930s Helena Gorey’s grandfather planted an orchard on the family farm in the townland of Burnchurch in Co Kilkenny. Trees do well in the rolling countryside of the locality, and the orchard flourished. By the time Gorey was a young child there in ...", "Singing their way to the Big Apple SALEM — Salem High School’s a cappella choir, WitchPitch? will represent the Northeast and compete against high schools from all over the U.S. in three weeks. But first, they’ll perform for the home crowd. WitchPitch? will join Redline, a ...", "The apple of her eye In the 1930s Helena Gorey’s grandfather planted an orchard on the family farm in the townland of Burnchurch in Co Kilkenny. Trees do well in the rolling countryside of the locality, and the orchard flourished. By the time Gorey was a young child there in ...", "Why Apple should fix the way iTunes Store purchases work Buying from the iTunes Store is certainly convenient. With a few clicks, I can purchase an album, TV show, or movie that gets billed to my iTunes account and that I know will work perfectly on my various pieces of Apple hardware (Macs, Apple TV ...", "NUEVO: Cheddar, turkey, apple sandwich is a winner Leigh Ann Gosney likes to experiment in the kitchen and rarely uses a cookbook to come up with original combinations that she and her husband, Brett, can enjoy. She had no idea that one day her creative kitchen skills would earn her $10,000 and ...", "Big Apple is becoming the new Hollywood for A-list TV production: Report It's more than just \"The Tonight Show\" and its rumored return east. The Big Apple has become one of the most sought-after locations for the small screen, and the city benefits from its Hollywood pull. Right now there are 25 primetime episodic shows being ...", "iPhone 5S Release And A Possible (Not Possible) Launch Date: This Week In Apple Rumors Hello, ladies and gentlemen, and welcome to This Week In Apple Rumors, our regular look back at all of the week's unconfirmed gossip, questionably sourced reports and blatant speculation about future Apple products from around the Web!", "Diane Kruger & Joshua Jackson: Big Apple Lovers Hitting the streets in style, Diane Kruger and Joshua Jackson stepped out in New York City on Saturday evening (March 30). The Hollywood lovers rocked their designer duds while walking hand-in-hand and swiftly making their way past the awaiting paparazzi.", "Chris Martin: Brentwood Country Mart with Apple & Moses! Chris Martin gives his son Moses, 6, a shoulder ride while leaving the Brentwood Country Mart on Saturday afternoon (March 30) in Santa Monica, Calif. The 36-year-old Coldplay singer was also joined by his adorable daughter Apple, 8, to have ...", "Rare Apple photos: Cook in high school, Jobs back on the job OK, fanboys and -girls, it's time once again to haul out your digital scrapbooking materials and add to your collection of Apple-related odds and ends. Now we get to check out Tim Cook's groovy plaid pants and moppy head of hair courtesy of images from his ...", "ANOTHER BITE FROM A POISONED APPLE ST. SIMONS ISLAND, Ga. -- Food poisoning in one form or another has posed a danger all through my life; however, early on, it was the food itself, mistakenly consumed or imbibed, that brought on illness or death. Although it wasn't a common incidence it ...", "Let the great Easter Apple Hunt at Lyman Orchards in Middlefield begin MIDDLEFIELD — Forget that pesky little feel of winter this past week. Spring is officially here, and that can only mean the 29th annual Easter Apple Hunt at Lyman Orchards, which is Saturday, starting at 10 a.m. This isn’t one of those wild ...", "Apple Pie In a bowl lightly knead flour with the cold butter. Add few spoons of water to make the dough compact. Pack the dough in a plastic film and rest for half an hour in the fridge. Place the apples in a bowl. Mix some brown sugar and cinnamon to the apples.", "The Prettiest Apple Pie WASHINGTON, Pa. — For as long as anyone can remember, the Washington County Cattlemen’s Association (WCCA) has been hosting an apple pie contest and auction at the Washington County Ag Days weekend held annually in March. The auction raises money to ...", "Apple Rumored To Unveil Next iPhone In June, Start Selling In July Apple may unveil its next iPhone on June 20 and could start selling the device in July, IntoMobile reports citing Japanese-language MacFan, which also claims that a low-cost iPhone model may hit retail channels in August and will target emerging markets ...", "The Visionary Wore Purple: Steve Job’s Return to Apple Photo In his lifetime, Apple co-founder Steve Jobs was behind the innovation of gadgets that changed the world of mobile phones and computers as well become known for his fashion statement. Often seen in his signature black turtle neck, Mr Jobs also ..."]}, "banana": {"politics": ["CALIFORNIA FOCUS - UTILITY REGULATORS CREATING A BANANA REPUBLIC? CALIFORNIA FOCUS - UTILITY REGULATORS CREATING A BANANA REPUBLIC? Banana republics got their appellation during the 1920s, when dictators ruling countries like Honduras and Guatemala made decisions on the say-so of banana growing companies ...", "Quinn Slips On A Banana Peel Gov. Pat Quinn wants every schoolchild to eat a healthy breakfast. But he says the state can’t afford to pay for that breakfast. From the Associated Press: Gov. Pat Quinn goes bananas almost every day. The Chicago Democrat said Wednesday he often ...", "Appeal isn’t everything – as a banana proved So how will history remember David Miliband? A key figure in the New Labour revolution? The best leader his party never had? A ditherer, who had his chance but blew it? Or simply as the brother of someone important? All perhaps, or none; history tends to ...", "Colombia: Banana growers looking for solutions to the crisis The Banana Growers Association from Magdalena and La Guajira (Asbama) asked the National Government to create an agenda that would allow them to look for solutions to the crisis in this sector. The problems are attributed to the revaluation of the peso ...", "Marco Rubio Narrowly Leads GOP Presidential Pack, Jeb Bush in Fourth, Poll Finds Hope you like a long, drawn-out campaign, GOP faithful! Because three years out from choosing a nominee to run in the 2016 presidential race, Republican voters aren't showing any inclination toward picking a favorite yet. Marco Rubio narrowly leads the ...", "In Wisconsin, Voters Reject ALEC/Walker Education Agenda Tony Evers, Wisconsin’s Superintendent of Public Instruction, easily won reelection on Tuesday. Unconfirmed official results have Evers beating opponent State Representative Don Pridemore by 61 percent to 39 percent. Pridemore, who has served in the ...", "We Spy: Sproul turns weird during ASUC elections Two words: banana suit. We not sure if this is the best election strategy, but it definitely made us give them a little more attention. There’s just something about a banana suit that makes you stop and stare. Maybe it’s the bright yellow ...", "Pittsburgh Councilman Dowd endoreses Peduto for mayor Pittsburgh City Councilman Patrick Dowd, a former mayoral candidate himself, threw his support Wednesday to his council colleague, Bill Peduto. He joins council members Natalia Rudiak and Bruce Kraus in supporting the East End Democrat. The rest of the ...", "Conn. lawmakers set to pass nation's toughest gun laws The Connecticut General Assembly is poised to pass the nation's toughest gun laws Wednesday that would strengthen an existing ban on semiautomatic assault rifles, limit the capacity of ammo magazines, and require background checks for all weapon sales ...", "Keehn named Shawnee's Officer of the Year Another special award was the \"Cheeseburger and Banana Shake\" award, which honored Cpl. George Stafford. Stafford, while negotiating with a barricaded person inside a home, talked with the man who requested a cheeseburger and banana shake.", "How liberalism beat conservatism in California: Paul Krugman “The country’s showcase state,“ gloated The Wall Street Journal, “has come to look like a hapless banana republic.“ But a funny thing happened on the road to collapse: It turned out that the main culprit in the electricity crisis was ...", "Hurt thanks local officials, discusses actions in D.C. About 65 members of boards of supervisors, town councils and school boards, along with town managers, constitutional officers, three members of the House of Delegates and others, dined on chicken, potato salad and banana pudding for dessert at ...", "Conn. lawmakers to vote on gun control package HARTFORD, Conn. — Responding to one of the worst crimes in state history, Connecticut lawmakers were expected to pass a package of gun control and other measures, described by supporters as the most comprehensive in the country. Debate on the ...", "'Groundhog Day:' Another scandal rocks Albany ALBANY — Three of the last five state Senate majority leaders have been indicted or are in jail for corruption. At least 26 state lawmakers have dealt with ethical problems or criminal charges since 2000. On Tuesday, another scandal rocked the ...", "Legislature to end session Thursday due to school deal BOISE (AP) — Lawmakers reached a deal on a $1.3 billion public schools budget, clearing the way for the session to adjourn Thursday by agreeing to a 2014 spending plan with only modest changes from the one that failed on the Senate floo ...", "'Groundhog Day:' Another scandal rocks Albany ALBANY — Three of the last five state Senate majority leaders have been indicted or are in jail for corruption. At least 26 state lawmakers have dealt with ethical problems or criminal charges since 2000. On Tuesday, another scandal rocked the ...", "Lawmaker accused of bribes in NYC mayor race plot NEW YORK — For the politically ambitious, running as a Republican is sometimes the best way a Democrat can increase his electoral odds in New York City's crowded mayoral race. Now, a federal prosecutor says one Democratic state lawmaker went ...", "Legislature to end session Thursday due to school deal BOISE (AP) — Lawmakers reached a deal on a $1.3 billion public schools budget, clearing the way for the session to adjourn Thursday by agreeing to a 2014 spending plan with only modest changes from the one that failed on the Senate floo ...", "Come and get your republican popsicles Sources inside the Beltway have indicated that Paul Ryan, Wisconsin, defeated candidate for vice-president, is fuming that Party leadership turned down his flavor suggestion, “Paul Ryan’s Super-Happy Fun Time Strawberry-Banana Ice Stick.”", "Challengers win Willard elections Two challengers have unofficially been elected to office in Willard, including a 79-year-old first time public servant. Wendell Forshee was voted mayor over alderman Bryan Vincent, 53 percent to 47 percent. In the only contested alderman race ...", "Another Democrat enters race for Pennsylvania governor Lured by Gov. Tom Corbett's languishing poll numbers, the swelling roster of his rumored or declared challengers has reached double digits. While supporters argue that the Republican has plenty of time to right his listing political ship before the 2014 ...", "Leadership bill to cut Oklahoma income tax stalls OKLAHOMA CITY — The chairman of the Senate Finance Committee on Tuesday stalled a leadership-backed proposal to cut Oklahoma's income tax, but later said he expected to bring the bill back up for a hearing before a Thursday deadline. The decision by Sen ...", "ExxonMobil Arkansas Tar Sands Spill Reignites Keystone XL Debate Opponents of the Keystone XL pipeline have long warned of the catastrophic impacts of a major spill if the infrastructure were to fail. On Friday, the nation no longer had to imagine how a tar sands disaster would look. The city of Mayflower, Arkansas was ...", "Bribery scheme tied to NYC mayor's race ALBANY Former state Senate Majority Leader Malcolm Smith allegedly tried to pay his way onto the Republican ballot line in the New York City mayoral race as prosecutors charged him and five others Tuesday in a far-reaching bribery scheme. The ...", "News Tickets go on sale soon for upcoming Jackson concerts by English progressive rock band YES and by folk-world-blues musician Taj Mahal. A new study by the Center for Disease Control and Prevention says that nearly 20 percent of teen births in America are ...", "Marijuana legalization bill gets first hearing House Bill 3371 will be heard by the House Judiciary Committee at 1 pm today in Hearing Room 343. Forty years after possession of small amounts was decriminalized, Oregon lawmakers will consider a bill to regulate the production, processing and ...", "Horsford: Nevada needs to pursue federal money Nevada needs to invest more in schools and its higher education system and make a concerted effort to seek available funding to ensure it receives its fair share of federal money, U.S. Rep. Steven Horsford told members of the state Legislature ...", "Student sought man on Craigslist to beat her up and have sex with her, then reported it as rape With fresh bruises to substantiate her twisted tale, Triplett then notified 911 that a mysterious assailant had raped and pummeled her while she was walking on a path looking for banana slugs (the UCSC mascot, incidentally). Prosecutor Johanna Schonfield ...", "Gov. Kitzhaber signs tuition bill allowing in-state tuition for immigrant students Gov. John Kitzhaber signed into law today a bill allowing in-state tuition for immigrant students without documents. “This bill will help them get their shot at the American dream,” he said to legislators, advocates and students packed into ...", "Albany County Clerk Tom Clingan to retire ALBANY — Albany County Clerk Thomas Clingan, 61, the longest-tenured elected county clerk in 263 years, announced Tuesday that he will not seek re-election this year and will retire in December after 25 years in the position. He brought to the job an ..."], "business": ["SouthPark Banana Republic to celebrate reopening CHARLOTTE, N.C. -- The Banana Republic is finally open for business following the severely damaging July 2012 roof collapse at SouthPark Mall. The store officially opened its doors a week ago, last Wednesday, but is celebrating their official Grand ...", "Banana cultivation pays Parbat youth well Chhetri earns over Rs. 200‚000 from banana cultivation in a year.. PHALEBAS: A youth who has received a Masters' degree has been involved in banana cultivation here when the number of Nepali youths going for abroad jobs is increasing day by day.", "Villa Banana HD for iPad Released - Fun Match 3 Game [prMac.com] Sheffield, United Kingdom - Notus Games studio today is pleased to announce the worldwide App Store release of the new Villa Banana HD. The game has been released in English, German, Russian and Ukrainian. Eight more languages will be added ...", "Tamil Nadu banana output doubles but prices continue to rise CHENNAI: The economics of food pricing in the state is enough to make you go bananas. Tamil Nadu grows more bananas than any other state and has had a bumper crop this year, but retail prices of the fruit are steadily on the increase. The ...", "Villagers set to benefit from banana project CHIPINGE — More than 200 small-scale irrigation farmers in Mutema and Chibuwe villages are set to benefit from a banana plantation project financed by Matanuska, a farming concern controlled by Malaysian investors. The company last year gave ...", "Chilli, banana value-chain platforms launched KARACHI: The United States Agency for International Development (USAID) held the first of its kind, consultative orientation meeting in Hyderabad recently to launch chilli and banana value-chain platforms (VCPs) in Sindh. The event was organised as part of ...", "Forget expensive serums, just a banana a day can banish puffy eyes Forget spending hundreds of pounds every year on the latest beauty creams and serums, according to top Hollywood nutritionist Kimberly Snyder, simply eating the right foods can do wonders for your skin and hair. Snyder, whose clients have included Drew ...", "Banana platina, new variety to be released in the Brazilian market next year Derived from the banana prata, the fruit is the result of 10 years of research and promises to bring benefits to Brazilian producers. The company Ceagesp, the main fruit and vegetable warehouse in Brazil, presented the banana platina, a different variety ...", "THE BANANA FIGHTS BACK I was pleased to read a recent news article commenting that Asda is the first UK supermarket to sell Canarian bananas through 230 of its UK stores. This initiative represents the first time in recent history that bananas from the Canary Islands are sold ...", "Yes, Healthful Fast Food Is Possible. But Edible? You can also get wine (biodynamic), beer (organic) or a better-than-it-sounds banana-kale smoothie. However, I fear that Lyfe’s ambition, and its diverse menu, will drive up equipment and labor costs, and that those costs are going to keep the chain from ...", "Phoenix Premium Outlets preps for April 4 grand opening Banana Republic, Tommy Bahama, BCBG Max Azria, Brooks Brothers, Calvin Klein, Charlotte Russe, Columbia Sportswear, Converse, DKNY, Dressbarn, Elie Tahari, Gap, Rawlings Sporting Goods and more. It is owned by Premium Outlets, which is based in ...", "4 Rivers Smokehouse plans late May opening of first Jacksonville restaurant “There are no microwaves,” he added. Additionally, each 4 Rivers restaurant features The Sweet Shop, a dessert storefront offering cupcakes, cakes, banana pudding, bread puddings, peanut butter fluff and more, all made fresh daily. (Rivers ...", "Kenya: Gatundu Ex-Teacher Shows Farming Pool Starting with one greenhouse and 100 tissue banana plants, he is today the proud owner of three greenhouses where he grows corazon tomatoes. He also has 1,400 banana stems and three fish ponds that earn him a good income. During an interview at his ...", "Cuts could ax 100 families from Section 8 A housing program that subsidizes rent and utilities for low-income families will see a federal funding cut that's the equivalent of the assistance provided to more than 100 households. The Guam Housing and Urban Renewal Authority recently ...", "Legal battle brewing over plan to close airport towers Central Idaho officials say they’ll seek a court injunction to prevent the federal government from shutting down the air traffic control tower at the Hailey airport through which tourists pass on their way to the resort areas of Ketchum ...", "Legal battle brewing over plan to close airport towers Central Idaho officials say they’ll seek a court injunction to prevent the federal government from shutting down the air traffic control tower at the Hailey airport through which tourists pass on their way to the resort areas of Ketchum ...", "Celebrating 30 years in business at Pappy's Cafe 822 Town & Country Blvd., 713-730-3013 Jamba Juice smoothie deal Through May 20, Jamba Juice is offering three of its 16-ounce Classic Smoothies - Aloha Pineapple, Banana Berry and Strawberry Surf Rider - for $2.49. Find the nearest location at jambajuice.com.", "Street closings, detours announced for road milling work in Elmira Street closings have been announced for road surface milling that is part of roadwork projects in the City of Elmira: • Davis Street from Kendall Place to Bancroft Road will be closed to traffic April 15. Northbound traffic will be detoured to ...", "TriState Capital Bank plans to go public TriState Capital Bank, a boutique bank Downtown launched in January 2007 by former Pennsylvania Banking Secretary A. William Schenck and two partners, has announced plans to go public. The bank expects to raise up to $70 million in the offering, according ...", "Former HMV store on Grafton Street for rent at €1m Zara owner Inditex is expected to be high on the list of international fashion traders to be targeted by agent Savills when it launches a marketing campaign later this week to find a replacement tenant for HMV in one of the best-proportioned stores on ...", "Spring Black Friday Marks the Start of Home Improvement's Busiest Shopping Season The Home Depot's Spring Black Friday, a Prime Opportunity to Upgrade the Home for a Fraction of the CostPR Newswire ATLANTA, April 3, 2013 /PRNewswire/ --The Home Depot, the world's largest home improvement retailer, today announced it will ...", "5 Eco-Friendly Fabrics To Have and To Hold In the past, consumer goods such as bathroom and bed linen; clothing; and outdoor apparel were designed and manufactured to last, with both consumers and suppliers leaning towards quality rather than quantity. The trend now, for the most part, is to mass ...", "USDA taking applications for health care grants ALEXANDRIA, La. (AP) — The U.S. Department of Agriculture is taking applications for $3 million worth of health care projects for communities of up to 50,000 people in the eight-state Delta region. Undersecretary for Rural Development Dallas ...", "Japan Government Urges BOJ to Focus on Easing TOKYO--With the Bank of Japan now into a potentially historic policy meeting under new leadership, government officials said Wednesday it should act without worrying about the financial risks of buying longer-term assets. Newly appointed Bank of Japan Gov ...", "Amsterdam's Renovated Rijksmuseum Shines 750,000 Innovative LED Lights On Its Art The Seville, Spain-based firm Cruz y Ortiz Arquitectos, who won the international design competition for the expansion in 2001, have transformed the old 19th century building into a modern exhibition facility. They have recreated the layout designed by the ...", "Farmers markets help entrepreneurs bud, blossom Chancey Lindsey-Peake of Greenville used to bake banana bread simply for the joy of it. It became her means of survival when the family she worked for moved away and she had no job. After years of “chugging along” from farmers market to ...", "Cherryland's solar project proves popular TRAVERSE CITY — Customer demand for Cherryland Electric Cooperative’s solar panel project in Grawn is strong, prompting an increase in the number of solar panels available in the venture’s initial phase. Cherryland officials on March 6 said they plan ...", "Survey: Frugality reigns 5 years after crisis BOSTON — The frugality and investing discipline that the 2008 financial crisis imposed on Americans appear to have led to permanent changes in behavior on money matters, according to a survey by the nation's second largest mutual fund company ...", "Business Highlights As Facebook matures, is it losing its edge? NEW YORK (AP)—To see what Facebook has become, look no further than the Hutzler 571 Banana Slicer. Sometime last year, people began sharing tongue-in-cheek online reviews of the banana-shaped piece ...", "IMF, World Bank not doing enough for debtor countries IN recent years, the small states of the Caribbean have experienced low rates of economic growth, with the last rapid growth spurt in the 1980s that was fuelled mainly by expansion of tourism, banana exports and public investments. The slowdown that ..."], "entertainment": ["Go Bananas For Vanilla Wafer Cookies & Banana Pudding! Popular desserts are always hard to top. Banana pudding is one of those things that can’t be improved just made right. This recipe for banana pudding ensures that this popular, delicious dessert is made properly. The best part about banana ...", "Lee Seung Gi To Appear As Hero In Upcoming Banana Yoshimoto Romance Novel 'Shall We Love' For Women's Magazine Anan Lee Seung Gi will soon be able to add romance novel hero to his resume. The K-pop star will be immortalized as the central character of Banana Yoshimoto's upcoming serialized romance novel 'Shall We Love,' to be published in the women's magazine ...", "ODC and Banana Republic Dance Downtown Opening Night Gala Dinner, dancing and one fabulous party. What better way for ODC Dance Company and Banana Republic to celebrate their newly formed collaboration than with a trio of events in one perfectly choreographed evening. Jack Calhoun, Global President of Banana ...", "Rockin' the West: Kahlua Cream Banana Cookies (Photos) A cookie is a cookie is a cookie, or so the adage goes. Sometimes, however, a cookie has the ability to separate itself from the ordinary. In the case of this brand new recipe from Chef Larry Edwards, it's not just the cookie that is incredible, it is also ...", "Dishes in the desert: Banana cake a delightful spring dessert I had four bananas sitting in my fruit bowl, ripe and ready to be used in something delicious. A few days ago, I was wandering through Pinterest and found this banana cake recipe (afarmgirlsdabbles.com/2013/02/15/banana-cake-with-cinnamon-cream-cheese ...", "'Mad Men' Banana Republic 2013: Costume Designer Janie Bryant Nails It! [PHOTOS] Mad Men costume designer Janie Bryant's latest collection for Banana Republic brings Don Draper style to those of us who aren't starring in a period drama. Follow Us The mod Sixties are as relevant as ever in today's fashion climate. Supermodel ...", "Banana Slug Sting Band: Local group continues educating after 28 years For 28 years, the Santa Cruz-based Banana Slug String Band has sought to simultaneously educate and entertain local students by delivering didactic bluegrass music. \"It really plants the seed for further investigation; there's a huge amount of ...", "Tyler Florence's Banana-Pecan Pancakes with Maple-Honey Butter. Chef Tyler Florence brought his passion for uncomplicated recipes and bright colors to Good Morning America. Preheat the oven to 200 degrees F. In a large mixing bowl whisk the buttermilk, eggs, and vanilla together so they are well combined. In a separate ...", "Falling in Love With Banana Republic's 'Mad Men' Collection Half the fun of watching Mad Men is drooling over Jon Hamm and the 1960s designs that the cast wears so well. Joan's body-hugging office wear and Betty's picture-perfect riding suits speak wonders of their complex and captivating personalities. Seriously ...", "Side Dish: Springtime Saturday Brunches at Apollo Grill The menu features entrees such as banana bourbon pecan French toast, quiche and omelet du jour, creamed chipped corned beef over cornbread or black pepper Parmesan southern biscuit, Monte Cristo sandwich with fried egg and corn-jalapeno polenta ...", "Bayou Lucy’s delivers New Orleans delicacies Unlike typical yellow cornbread , this one mixes warm spices with a light sweetness, similar to a pumpkin or banana bread but far better. For dinner, we chose the shrimp etouffee with a side salad ($14.95) and crawfish po’boy with fries ($11.95).", "Elvis Presley’s Daily Driver, Lawn Mower Racing, Automotive Anniversaries Highlight This Week’s Food Lion AutoFair at Charlotte Motor Speedway The menu features many items, including a grilled peanut butter and banana sandwich, Graceland Delight banana pudding topped with bacon and Blue Hawaii lemonade. The Jailhouse Rock Café menu will be available at a special location in the ...", "A Chocolate Lovers Emotional Affair (Photos) Banana and caramel flambéed with rum is a chocolatier’s version of bananas foster. When big concepts come in gourmet bite-sized surprises, sometimes we fall in love. If kisses came in flavors, this would be one of my favorites. Yet one day ...", "Morris Park: The Bronx's litte secret 718-409-9069 Yucatán, 2107 Williamsbridge Rd. Yucatán brings a taste of Mexico to the area with dishes like Jalapeños Rellenos (pickled jalapeños stuffed with tuna), Cochinita Pibil (slow-cooked pork with a spice and citrus rub wrapped in a banana leaf ...", "New Gourmet Beef Jerky with Filipino Pride breaking through the Jerky biz Spicy Tocino takes the original marinade of pineapple, banana ketchup, brown sugar, and lemon-lime soda, with a touch of spice. The combination of sweet and a little heat surely is mouth watering and keeps you craving for more. “My goal is tha ...", "A Tasty Roll Call Imagine a masterpiece of Swiss almond vanilla ice cream and banana pudding atop a crunchy cracker crust, with an apple banana brûlée and banana-rum caramel sauce topping. Share, if you can. The dessert was created by retired KCC teacher-Chef Eddie ...", "Restaurant reveiw: Subtle flavours, great ingredients make Mui Ngo Gai stand out Chicken wings ($3.50 for five pieces) are cleanly cooked without a greasy residue. Steamed pork and shrimp dumplings, wrapped in banana leaf ($7 for 10 pieces) are delicate and translucent. I’ve had a lot of green papaya salads in Thailand ...", "Chattanooga Native And Author Ingram To Kick Off Bessie Smith Cultural Center's Lecture Series Ms. Linn, a resident of Cumming, Ga., will be available to sign copies of her book, Drowsy Eels on Banana Peels. Review for Drowsy Eels on Banana Peels: Did you see that? Dancing elephants and singing bees. Pigs ... (click for more) Westside ...", "Leigh Ann Linn Has Book Signing April 13 Ms. Linn, a resident of Cumming, Ga., will be available to sign copies of her book, Drowsy Eels on Banana Peels. Review for Drowsy Eels on Banana Peels: Did you see that? Dancing elephants and singing bees. Pigs in wigs and goats who say ...", "Broomall Couple to Open Wayne Cafe The fun will really come out in the desserts, they said, including classics like banana splits and root beer floats. But their ice cream creations are what they have been successful with in their Philly shop, which they will be closing to focus on Sophie's.", "9 Girl-friendly beers A quick sniff will reveal the aromas of fruits like banana and papaya and just a bit of clove. Don't let the flavor combo scare you, though. Sierra Nevada is good at taking complex mixes of ingredients and making a cohesive overall flavor profile.", "'Wouldja look at that Golden, over by the fence? Poor thing -- he's lost his tennis ball!' \"Close the cooler, hoping that the cover will keep the exploding bananas contained. Wipe exploded, fermented squished banana from body, cooler, table, chair, ceiling, ceiling fan, and floor. Take a shower; be grateful that there are no clothes ...", "Autograph Session to Follow Spring Game The Big Boomer Barbeque also includes a number of free activities and events for the entire family. Banana Seat will once again provide live music, while amusement rides including Pirate's Revenge, Elephants, Apples, Hurricane and Castlemania will be ...", "Audrina Patridge: The Top 3 Qualities I Look For In A Boyfriend We also asked Audrina about her favorite scents! “Banana bread reminds me of my grandma’s kitchen, gardenia reminds me of my aunt, cherry reminds me of my brothers car freshener. Curve reminds me of high school because ALL the guys wore ...", "The Canary in the Coal Mine Tells All Take me home and prepare me a birdbath. I will tell you a story.\" I brought Tweety back to my place and polished him up until he shone like a banana. Once the bird was clean, he began to sing. \"You have saved a very important bird,\" he said. \"I come from a ...", "The Man Who Invented Beer: Saint-Benoit Brune Sweet nectar. The full-bodied taste, which is overwhelmingly sweet with a little bit cinnamon-like spice, masks any trace of the alcohol content, and it’s got a distinct banana aftertaste not unlike a hefeweizen. Really, it reminded me most of ...", "AXA ART Presents Damages From Hurricane Sandy at Its Lounge During 2013 AIPAD Photography Show New York Via Electric Banana: As he explained to Good, hi ... Mike D. of the Beastie Boys has helped give away 19,000 free meals since Hurricane Sandy hit his native New York last fall. Along with restaurateur friend Robert McKinley, they have partnered with some ...", "Sweet Nothings Mrs. Sweet is a \"horrible bitch who'd arrived on a banana boat\"; Mr. Sweet is \"old and the size of a mole.\" This viciousness is funny at first, but it gets old fast. The allusion to mythology, so promising in the early chapters, is soon obscured ...", "On the fridge In celebration of Earth Day, the 2nd Annual Savor Guam Food Festival will feature students from Guam Community College preparing dishes made from Guam produce and seafood. Categories of appetizer, entrée and dessert will be judged by a panel ...", "'Jew in a Box' exhibit stirs controversy \"Why don't they give him a banana and a glass of water, turn up the heat and make the Jew feel really cozy in his glass box,\" prominent Berlin Jewish community figure Stephan Kramer told The Associated Press. \"They actually asked me if I wanted ..."]}}
