{"description": "The Texas Aggie baseball team was doomed by a three-run eighth inning by South Carolina and dropped a 6-3 decision to the Gamecocks in the series finale on Saturday afternoon at Carolina Stadium. The series sweep leaves Texas A&M at 5-4 in SEC play.", "title": "Aggies Can't Avoid the Sweep"}
{"description": "RANCHO SANTA FE, Cal. --- The Texas A&M women's golf team moved up two spots into seventh place at the SDSU Farms Invitational on Monday. The 22nd-ranked Aggies shot 305 Monday, improving on their opening round by six shots. It was the fifth ...", "title": "Aggies up two spots to seventh at SDSU Farms Invitational"}
{"description": "Since joining the SEC, Texas A&M has been able to use it’s new conference affiliation to lure recruits from the fertile recruiting grounds of the Lone Star state. While A&M has been able to take the reigns within its own state, the Aggies are also ...", "title": "Texas A&M recruiting goes westward looking to land Aggie legacy"}
{"description": "The Texas A&M Football team will have to replace 11 starters from its 2012 roster. The Aggies need to have multiple players step up and become difference makers if they are going to experience success in 2013. The Aggies lost six starters from their ...", "title": "Texas A&M Football: 5 New Starters Imperative to the Aggies' Success in 2013"}
{"description": "BIRMINGHAM – SEC Athlete of the Week honors were awarded to three Aggies this week. Ameer Webb was named men’s SEC Runner of the Week, Shelbi Vaughan was chosen the women’s SEC Field Athlete of the Week and Aldrich Bailey, Jr. was selected ...", "title": "Three Aggies earn SEC Athlete of the Week honors from Texas Relays performances"}
{"description": "On paper, the Texas A&M Aggies will be the early favorites to be the best college football team in the state next season. But a plethora of top-end talent leaving for the NFL (not to mention a target placed squarely on the back of Johnny Manziel ...", "title": "Tell us: Will Texas or Texas A&M football have a better year in 2013?"}
{"description": "For newcomers or players who are stepping into new roles, spring football is an important time to develop and get acclimated to their surroundings. The same can be said for new coaches. Texas A&M has three new position coaches this spring -- special teams ...", "title": "Texas A&M Aggies:"}
{"description": "COLLEGE STATION, Texas — Many of the country’s top collegiate golfers descend on Aggieland this weekend as Texas A&M hosts the Aggie Invitational at Traditions Golf Course. Admission is free for fans as the tournament begins with 36 holes ...", "title": "Texas A&M Set to Host Aggie Invitational"}
{"description": "“As a community dedicated to respecting diversity, we support measures sincerely aimed at protecting the religious beliefs of Texas A&M students, including those of many within the LGBT community,” GLBT Aggies wrote in a news release about the Student ...", "title": "GLBT Aggies gear up for forum on anti-gay Student Senate bill"}
{"description": "Actually, it’s his alter-ego — Johnny Football — that appears to have the issue. Like a modern day Jekyll and Hyde, the Texas A&M quarterback has found himself justifying the off the field actions created by his on the field persona.", "title": "Columnist rips Texas A&M's Johnny Manziel, Kevin Sumlin; Heisman winner needs to show 'maturity'"}
{"description": "whether they are Aggies, Bears, Horned Frogs or Longhorns. He ran as a Democrat for the Texas House, served as chairman of the Galveston County Democratic Party and contributed to numerous Democrats. He has contributed more than $200,000 to the Texas Trial ...", "title": "Why Rick Perry picked a Democrat — and a trial lawyer — for the Aggie board of regents"}
{"description": "be they Aggies, Bears, Horned Frogs or Longhorns. He has run as a Democrat for the Texas House, served as chairman of the Galveston County Democratic Party and contributed to numerous Democrats. He has contributed more than $200,000 to the Texas ...", "title": "In Politics, Never Say Never to an Aggie"}
{"description": "The sting of Texas A&M's season-ending loss to Nebraska will go away with time, but what happened over the weekend sure didn't help. Nebraska, which played so hard and well in beating the Aggies, struggled mightily in a 53-45 loss to Duke.", "title": "Cessna: Aggie women's early exit from tournament not good enough for fans"}
{"description": "COLLEGE STATION, Texas -- Going into the 2012 season, Texas A&M defensive coordinator Mark Snyder could take some comfort in the fact that the Aggies' defense had experienced upperclassmen in key spots. With all of those players gone, the Aggies are ...", "title": "Aggies looking for leaders on defense"}
{"description": "Pardee came along early enough to have been one of Bear Bryant’s Junction Boys, the Aggies who toughed out Bryant’s first preseason camp in Junction, Texas, in 1954. When he returned to the game in 1987, he shepherded the run-and-shoot ...", "title": "Jack Pardee 'could adapt to anything'"}
{"description": "be they Aggies, Bears, Horned Frogs or Longhorns. He has run as a Democrat for the Texas House, served as chairman of the Galveston County Democratic Party and contributed to numerous Democrats. He has contributed more than $200,000 to the Texas ...", "title": "In Politics, Never Say Never to an Aggie"}
{"description": "COLLEGE STATION, Texas -- Going into the 2012 season, Texas A&M defensive coordinator Mark Snyder could take some comfort in the fact that the Aggies' defense had experienced upperclassmen in key spots. With all of those players gone, the Aggies are ...", "title": "Aggies looking for leaders on defense"}
{"description": "Pardee came along early enough to have been one of Bear Bryant’s Junction Boys, the Aggies who toughed out Bryant’s first preseason camp in Junction, Texas, in 1954. When he returned to the game in 1987, he shepherded the run-and-shoot ...", "title": "Jack Pardee 'could adapt to anything'"}
{"description": "COLLEGE STATION, Texas – Despite a late rally, the No. 9 Texas A&M softball team fell to No. 4 Alabama, 4-1 in the Southeastern Conference series finale, Sunday at the Aggie Softball Complex. The Crimson Tide (32-5, 8-4 SEC) earned the series ...", "title": "Aggies Drop Series Finale to No. 4 Alabama, 4-1"}
{"description": "He grew up in Bethlehem, Pa., and earned his undergraduate degree in sociology from Princeton. But Trevor Van Ackeren had a slight understanding of the rivalry between Texas and Texas A&M. “I’ve definitely known about it,” said the UT graduate student.", "title": "Longhorns defeat Aggies in 3,200-meter relay at Texas Relays"}
{"description": "Thursday night's game will be featured on ESPNU. COLUMBIA, S.C. - The Texas A&M Aggies head to the Palmetto State looking to build on the recent momentum that has seen them win eight of their last nine games, including five of six in SEC action.", "title": "Aggies Hit Road for SEC Series at South Carolina"}
{"description": "ESPN analyst Todd McShay projects that 11 SEC players will be taken in the first round of next month's NFL draft, which would tie the SEC record for most first-rounders in one draft. The SEC produced 11 first-rounders in the 2007 draft. The record for any ...", "title": "SEC: Texas A&M Aggies"}
{"description": "College Station, TX – Jordan Hooper scored 21 points to lead the sixth-seeded Nebraska Cornhuskers to a 74-63 upset of the third-seeded Texas A&M Aggies in the second round of the 2013 NCAA Women's Tournament at Reed Arena. Lindsey Moore added ...", "title": "Nebraska takes down Aggies to advance to Sweet 16"}
{"description": "The team rankings are in their infancy, but some things can be gleaned from the data. First, Texas A&M is doing a fantastic job early by landing 10 commitments, including six four-star pledges, more than any other team in the country.", "title": "Aggies top (very) early team rankings"}
{"description": "If the student fee portion is cut significantly, the center would be in danger of closing, hurting thousands of Aggies. America is changing, and Texas A&M must change along with it. A&M has a well-earned reputation as a welcoming place ...", "title": "Aggies must not exclude fellow students"}
{"description": "The Longhorns have continued to recruit Harvey, who has been committed to the Texas A&M Aggies since late November. A Junior Day visit didn't happen, but the versatile prospect who has the talent to play wide receiver, cornerback or safety at ...", "title": "Texas A&M commit Nick Harvey visits Texas for spring game"}
{"description": "\"We are still in the process of fighting to exist and be positively acknowledged at Texas A&M,\" the GLBT Aggies said in a statement released this week. \"While [the bill] claims to promote religious freedom, we cannot ignore that it only allows students ...", "title": "Aggie student leader proposes bill to opt out of paying for GLBT Center on campus"}
{"description": "The Texas A&M Association of Former Students is offering to help Aggies find a Muster event near their locations. With more than 300 Muster ceremonies held around the world annually on April 21, the association has made it easy for former ...", "title": "Texas A&M alumni group helping Aggies attend Muster"}
{"description": "Some eight years ago I wrote a long piece in the Chronicle that detailed the region’s desultory efforts to create a hub of biotechnology. While Texas in general, and Houston in particular, has excellent medical care and biomedical research facilities ...", "title": "Thanks to the Aggies, Texas may have its opening to become a biotech hub"}
{"description": "COLLEGE STATION, Texas | In a tightly contested series opener between two top-10 teams, the No. 9 Texas A&M Aggies downed No. 4 Alabama, 3-2, Friday night at the Aggie Softball Complex. The Crimson Tide moves to 30-5 overall and 6-4 in ...", "title": "Aggies top Alabama softball"}
{"description": "Adrian Phillips had a rough junior season. One that he would probably rather forget. Perhaps the poster child for the maligned Texas Longhorns secondary that often gave up yards in big chunks because of missed tackles, the Garland product needed ...", "title": "Texas Longhorns spring football: Is Adrian Phillips back?"}
{"description": "With the Texas Longhorns having recently installed yet another new offense, many positions are very much works in progress as the 'Horns continue to prepare for the upcoming 2013 season. Since Mack Brown began restructuring his ailing program ...", "title": "Texas Football Spring Practice: Everything You Need to Know About the OL"}
{"description": "While students may be familiar with the sight of Bevo at football games and rallies, several UT researchers took a look at a side of the Texas longhorn seldom seen: its genes. The research group, comprised of biology professor David Hillis, Ph.D ...", "title": "Researchers determine genetic ancestry of the Texas Longhorn"}
{"description": "Not so long ago, the Texas Longhorns would routinely receive commitments from a handful of prospects on Junior Days in February, a process that has now slowed down to vault a weekend like that just experienced by the 'Horns into the rarefied air ...", "title": "Texas Longhorns recruiting: Spring game helps net five commitments"}
{"description": "The Texas Longhorns had a very strong weekend on the recruiting trail and, as it stands, there's plenty to look forward to in regards to both the 2014 and 2015 class. This is the type of recruiting weekend that coaches dream of, and frankly this is the ...", "title": "Texas Football Recruiting: Breaking Down Longhorns' Newest 2014, 2015 Commits"}
{"description": "Join ESPN RecruitingNation's Jeremy Crabtree, Derek Tyson, Max Olson, Will Wilkerson and Damon Sayles at 1 p.m. ET on Wednesday for \"On The Trail TV.\" We’ll discuss the state of recruiting in South Florida and who does the best job in Miami. Is it Miami ...", "title": "Texas Longhorns: Florida State Seminoles"}
{"description": "Myck Kabongo has until later this month to determine whether he’s staying in school or going to the NBA. In his latest big board, ESPN’s Chad Ford moved Kabongo up from No. 34 to No. 30, which would put Kabongo in the first round. It’s an insider ...", "title": "Texas Longhorns PG Myck Kabongo slips into first round in latest ESPN draft projections"}
{"description": "AUSTIN, Texas -- It was only a matter of time before 2014 center Terrell Cuney (Jasper, Texas/Jasper) became a Texas Longhorn. That time came on Saturday. Cuney, who had told HornsNation in the past that he wanted to visit a few schools before making his ...", "title": "OL Cuney is No. 9 for Longhorns for 2014"}
{"description": "The Texas Longhorns have to win the Big 12 in 2013. Geno Smith is no longer at West Virginia, Collin Klein is no longer at Kansas State and Landry Jones is no longer at Oklahoma. Texas can no longer sit by and play mediocre football. There are ...", "title": "What Are The Expectations For The Texas Longhorns?"}
{"description": "As one of the best defensive minds in the NFL today, New York Jets coach Rex Ryan has always found a way to make his defenses work, year in and year out, no matter what. But in 2013, he may have his toughest task yet. Ryan will have to make a ...", "title": "The Texas Longhorns Number One Priority In 2013"}
{"description": "RANCHO SANTA FE, Calif. -- Seniors Madison Pressel and Desiree Dubreuil led the No. 16 Texas Women's Golf team with a pair of 12th place finishes at 9-over-par 225 to conclude the Farms Invitational. The Longhorns saved their lowest team score of the 54 ...", "title": "Pressel and Dubreuil record low finishes for No. 16 Women's Golf at Farms Invitational"}
{"description": "A research group from the Universities of Texas and Missouri has traced the origins of the Texas longhorn back to two extinct wild beasts in India and Europe. University of Texas-Austin biology professor David Hillis, Ph.D. candidate Emily Jane ...", "title": "Universities trace origins of the Texas longhorn"}
{"description": "Holding the Texas Longhorns spring game on the same day that the Texas Relays ended just next door provided a major recruiting advantage for the 'Horns that resulted in four commitments on Friday and Saturday combined, as well as a visit from ...", "title": "Texas A&M commit Nick Harvey visits Texas for spring game"}
{"description": "BUFFALO, W.Va. -- Noah Perry has spent a lot of time observing social interactions among cattle. \"There is a really pecking order. There is a boss cow. They rank each other, all the way down to the bottom. Sometimes there is a challenge,\" Perry sa8id ...", "title": "Texas longhorns roam in Putnam County"}
{"description": "AUSTIN, Texas, March 26 (UPI) -- The iconic Texas Longhorn cattle have a hybrid ancestry that tells a story of global migration of both cattle and humans, biologists say. The genome of the Texas Longhorn traces back through Christopher Columbus ...", "title": "Genes of Longhorn cattle show long history"}
{"description": "Holding the Texas Longhorns spring game on the same day that the Texas Relays ended just next door provided a major recruiting advantage for the 'Horns that resulted in four commitments on Friday and Saturday combined, as well as a visit from ...", "title": "Texas A&M commit Nick Harvey visits Texas for spring game"}
{"description": "BUFFALO, W.Va. -- Noah Perry has spent a lot of time observing social interactions among cattle. \"There is a really pecking order. There is a boss cow. They rank each other, all the way down to the bottom. Sometimes there is a challenge,\" Perry sa8id ...", "title": "Texas longhorns roam in Putnam County"}
{"description": "AUSTIN, Texas, March 26 (UPI) -- The iconic Texas Longhorn cattle have a hybrid ancestry that tells a story of global migration of both cattle and humans, biologists say. The genome of the Texas Longhorn traces back through Christopher Columbus ...", "title": "Genes of Longhorn cattle show long history"}
{"description": "Looking for a preview of Texas' new, faster offense? Look no further than the successful second half of the Longhorns' win over Oregon State. Colleague Mark Schlabach wrote today about the changes coming to Austin that already surfaced in the ...", "title": "Texas tempo change: Horns new offense"}
{"description": "Texas Longhorn cattle have a hybrid global ancestry, according to a study by University of Texas at Austin researchers published in the Proceedings of the National Academy of Sciences. The study of the genome of the Longhorn and related breeds ...", "title": "Texas Longhorn Genome Decoded"}
{"description": "Before playing in the NFL, McCoy was a highly decorated player for the Longhorns who compiled a record of 45-8 as a starter. The Tuscola, Texas native passed for more than 13,000 yards and 112 touchdowns during his career. During his senior ...", "title": "Former Longhorn quarterback Colt McCoy traded to 49ers"}
{"description": "Even as the Texas Tech has not skilled a lot success next to the Texas over the time period, the Red Raiders and Seth Doege might build things tough on Longhorns this instance around. Expecting to keep away from the 4th in a straight line defeat in this ...", "title": "Texas vs Texas Tech: Football TV Channel Schedule, Game Time, Rivalry match"}
{"description": "Texas landed their third commitment of the 2013 class on Saturday. The backcourt turnover for the Texas Longhorns is continuing. Recently the Longhorns landed a commitment from Demarcus Croaker, and that was followed with the announcement of Sheldon ...", "title": "Texas lands another"}
{"description": "Thanks for all your emails, everybody. Here's where you can reach me if you've got more to say. To your mail! Robert Powell in Plano, Texas, writes: Sir,While I like the Kingsbury hiring, I am concerned about 1. his lack of experience, and possibly more ...", "title": "Big 12: Texas Longhorns"}
{"description": "Junior quarterback David Ash threw two touchdown passes to help lead the Texas team over the Longhorns, 30-13, in the Orange-White Scrimmage Saturday evening at Darrell K Royal-Texas Memorial Stadium. Ash completed 17 of 24 passes for 162 yards for the ...", "title": "Texas squad outlasts Longhorns, 30-13, in Orange-White Scrimmage"}
{"description": "McClellan is the second Texas player to leave from a team that went 16-18. Forward Jaylon Bond, who played in 20 games, also decided to transfer. McClellan was the Longhorns' second-leading scorer in each of the past two seasons, averaging 11.3 points per ...", "title": "Longhorns' McClellan will transfer"}
{"description": "English had received his offer earlier in the day and didn't take long to end his recruitment. His ties to the Texas program probably helped make the decision easy -- DeSoto has been a pipeline school for Texas for some time and has sent ...", "title": "2015 DT Bryce English commits to the Texas Longhorns"}
{"description": "AUSTIN, Texas - Alex Okafor has more important things to worry about than Texas Longhorns' spring ball, and he is not about to trash a program that he obviously so dearly loves, but the man has some honest insight into what troubles his college ...", "title": "A former Texas player nails the Longhorns' second biggest problem"}
{"description": "the No. 4 Texas track and field team had a relatively quiet final day at the 86th Clyde Littlefield Texas Relays. But the Longhorns had entries in just two events Saturday at Mike A. Myers Stadium, which had a crowd of 16,549. Senior Keiron Stewart ...", "title": "No. 4 Men's Track and Field wraps up Clyde Littlefield Texas Relays with six wins"}
{"description": "AUSTIN – Texas’ pro day was almost certainly former Longhorns quarterback Vince Young’s last chance to work his way back into the NFL. At least 26 NFL teams were represented at Texas’ pro day, and most were there to get a closer look at safety ...", "title": "Texas’ pro day: Former Longhorns QB Vince Young takes advantage of almost certainly his last chance to work his back into NFL"}
{"description": "Kurt Roper has several titles for Duke: He is the assistant head coach, the offensive coordinator, and the quarterbacks coach. He joined Duke in January, 2008, and was promoted to assistant head coach this past February. Last year, Roper guided Duke’s ...", "title": "College Football Nation: Duke Blue Devils"}
{"description": "NORFOLK, Va. — Her voice hoarse after another disappointment in a regional final, Duke coach Joanne P. McCallie was in no rush to put a positive spin on a season in which the Blue Devils overcame a series of obstacles. \"I think there is a time ...", "title": "Duke falls short again, losing 87-76 to Notre Dame"}
{"description": "The 2012-13 season has come to an end for the Duke basketball program, but it was another exciting year for Mike Krzyzewski and his team. The Blue Devils finished the season with a 30-6 record and went 14-4 in the ACC, which by most people's ...", "title": "Duke Basketball: Top 5 Highlights of the 2012-13 Season for the Blue Devils"}
{"description": "The Irish had to rally past Duke to get there. Trailing by six at the half, Notre Dame took control with a 15-2 run early in the second half to take a 50-42 lead. The Blue Devils lost in the regional finals for the fourth straight year ...", "title": "Skylar Diggins leads Notre Dame past Duke, to Final Four"}
{"description": "NORFOLK, Va. (AP) -- The best phrase Duke coach Joanne P. McCallie to describe doing the unexpected is \"the tingle.\" McCallie has experienced it before. Now, she's hoping to experience \"the tingle\" again when the Blue Devils take on top-seeded Notre Dame ...", "title": "Duke-Notre Dame Preview"}
{"description": "Indianapolis, Ind. March 31, 2013 – Coach Rick Pitino was trying to relish the 85-63 win over the Duke Blue Devils, but it was clear that the possible career-ending injury suffered by guard Kevin Ware was foremost in his mind. With 6:33 ...", "title": "UofL beats Duke 85-63, despite Kevin Ware's compound fracture"}
{"description": "NORFOLK, Va. — Just getting to a regional final was probably accomplishment enough for a Duke womens basketball team that endured much adversity this season. But that did little to salve the pain the Blue Devils felt as Notre Dame", "title": "Duke women fall to Notre Dame, 87-76, in NCAA basketball tourney"}
{"description": "Davidson (8-19, 5-11 SoCon) opened the game with an early 1-0 lead, but Duke (17-13, 6-6 ACC) scored at least one run in four of the five opening frames to secure an advantage it would not relinquish the rest of the way. The Blue Devils churned ...", "title": "Blue Devils Top Wildcats for Fifth Straight Win"}
{"description": "This is the third straight year a second-seeded Duke team has met a top seed in the regional finals of the NCAA women's basketball tournament. No one expects the Blue Devils to have more luck against Notre Dame on Tuesday night in Norfolk ...", "title": "Irish women a big challenge for Duke"}
{"description": "INDIANAPOLIS -- Mike Krzyzewski already holds the NCAA record for most wins by a coach. Thanks to Seth Curry's big scoring night, Krzyzewski could finish the weekend by tying one of John Wooden's records. Curry scored 29 points, tied the school ...", "title": "Duke Tops Michigan State 71-61: Seth Curry Leads Blue Devils Past Spartans"}
{"description": "INDIANAPOLIS The Blue Devils had already had their NCAA-mandated, 10-minute cooling-off period, giving them time to absorb the reality of their season-ending loss, but Rasheed Sulaimon was still visibility upset when the doors opened for the media.", "title": "In 2013-14, Duke Blue Devils will be smaller, more athletic"}
{"description": "The 30-5 Duke Blue Devils from the ACC conference will face the 32-5 Louisville Cardinals from the Big East conference in an NCAA Tournament Elite Eight college basketball game on Sunday afternoon. Tip off time from Lucas Oil Stadium in ...", "title": "Duke Blue Devils versus Louisville Cardinals Pick Prediction NCAA Tournament College Basketball Betting Lines Odds Preview 3-31-2013"}
{"description": "The Blue Devil Network will stream live video of the game and Chris Edwards will call the action for the audio broadcast. Live stats are also available through GoDuke.com while fans cans also follow updates of each game via @Duke_BASE ...", "title": "Duke vs. Davidson l 6 PM l Durham Bulls Athletic Park"}
{"description": "Norfolk, VA (Sports Network) - Tricia Liston scored 17 points to lift the second-seeded Duke Blue Devils to a 53-45 win over the Nebraska Cornhuskers in the Sweet 16 of the 2013 NCAA Women's Tournament. Alexis Jones added 14 points, nine rebounds and six ...", "title": "Duke Women's Puts The Clamps On Nebraska To Become Elite"}
{"description": "Indianapolis, IN – Two iconic coaches meet in the Elite Eight, as Mike Krzyzewski's Duke Blue Devils take on Rick Pitino's Louisville Cardinals in the Midwest Regional final at Lucas Oil Stadium on Sunday. The winner advances to the Final Four ...", "title": "Duke tangles with Louisville in Midwest Regional final"}
{"description": "The second-seeded Duke Blue Devils earned their fourth straight trip to the Elite Eight round of play in the 2013 NCAA Women’s Basketball Tournament with a 53-45 victory over the sixth-seeded Nebraska Cornhuskers at Constant Convocation Center in Norfolk ...", "title": "Blue Devils headed to NCAA Elite Eight with win over Nebraska"}
{"description": "INDIANAPOLIS -- Mike Krzyzewski already holds the NCAA record for most wins by a coach. Thanks to Seth Curry's big scoring night, Krzyzewski could finish the weekend by tying one of John Wooden's records. Curry scored 29 points, tied the school ...", "title": "Duke Tops Michigan State 71-61: Seth Curry Leads Blue Devils Past Spartans"}
{"description": "INDIANAPOLIS The Blue Devils had already had their NCAA-mandated, 10-minute cooling-off period, giving them time to absorb the reality of their season-ending loss, but Rasheed Sulaimon was still visibility upset when the doors opened for the media.", "title": "In 2013-14, Duke Blue Devils will be smaller, more athletic"}
{"description": "The 30-5 Duke Blue Devils from the ACC conference will face the 32-5 Louisville Cardinals from the Big East conference in an NCAA Tournament Elite Eight college basketball game on Sunday afternoon. Tip off time from Lucas Oil Stadium in ...", "title": "Duke Blue Devils versus Louisville Cardinals Pick Prediction NCAA Tournament College Basketball Betting Lines Odds Preview 3-31-2013"}
{"description": "The Blue Devil Network will stream live video of the game and Chris Edwards will call the action for the audio broadcast. Live stats are also available through GoDuke.com while fans cans also follow updates of each game via @Duke_BASE ...", "title": "Duke vs. Davidson l 6 PM l Durham Bulls Athletic Park"}
{"description": "Norfolk, VA (Sports Network) - Tricia Liston scored 17 points to lift the second-seeded Duke Blue Devils to a 53-45 win over the Nebraska Cornhuskers in the Sweet 16 of the 2013 NCAA Women's Tournament. Alexis Jones added 14 points, nine rebounds and six ...", "title": "Duke Women's Puts The Clamps On Nebraska To Become Elite"}
{"description": "Indianapolis, IN – Two iconic coaches meet in the Elite Eight, as Mike Krzyzewski's Duke Blue Devils take on Rick Pitino's Louisville Cardinals in the Midwest Regional final at Lucas Oil Stadium on Sunday. The winner advances to the Final Four ...", "title": "Duke tangles with Louisville in Midwest Regional final"}
{"description": "It's up to the women now. The Louisville Cardinals under Rick Pitino, rallying after the gruesome leg break suffered by Kevin Ware, never gave Mike Krzyzewski's Duke Blue Devil men much of a chance. The last team from North Carolina - at least for the men ...", "title": "Editorial: Duke women keep the madness going"}
{"description": "Usually, that’s not a formula for success. But the Duke Blue Devils clamped down on defense to eliminate Nebraska 53-45 on Sunday in the semifinals of the Norfolk Regional at the Ted Constant Convocation Center. “We don’t want to be pretty ...", "title": "Defense spearheads Duke Sweet 16 win over Cornhuskers"}
{"description": "Notre Dame has won the first three this season and beaten UConn in the past two Final Fours. Tricia Liston led Duke (33-3) with 19 points, but the Blue Devils had no answer when Notre Dame used a 15-2 run early in the second half to take a 50-42 lead.", "title": "Notre Dame women defeat Duke 87-76 to reach Final 4"}
{"description": "Ware was hospitalized after he projected himself towards the sideline while contesting a 3-point shot against the Duke Blue Devils in the first half. Ware was hospitalized and his teammates went on to sink Duke with confidence. Please... In case you missed ...", "title": "Twitter Reactions After Kevin Ware Breaks Leg During Louisville-Duke Game"}
{"description": "Congratulations to Mason Plumlee, who was named to the Wooden All-America Team Monday. He was joined on the team by Miami’s Shane Larkin, the only other ACC representative. Plumlee’s decision to return for his senior year, it would seem, has paid off ...", "title": "Duke Blue Devils"}
{"description": "INDIANAPOLIS -- Defensive toughness, offensive productivity, combined with senior Seth Curry finding his hot shooting hand all made a nice combination for the Duke Blue Devils' 10-point, Sweet Sixteen win Friday evening over Big Ten foe Michigan State.", "title": "Curry's hot shooting propels Duke to Elite Eight"}
{"description": "After being the champions of the AFC West for five out of six years from 2004 to 2009, the San Diego Chargers have painfully watched their division rivals take what they thought would be theirs for the past three seasons. Fans are tired of ...", "title": "2013 NCAA Tournament: No. 2 Duke Blue Devils Offense A No Show In Elite Eight"}
{"description": "The second-seeded Duke Blue Devils have taken the trip to the NCAA Women’s Basketball Tournament Regional many times – 15 times in the last 16 years to be exact. As they held one more practice on Friday morning at the Michael W. Krzyzewski Center ...", "title": "McCallie prepares Duke to continue along road to Final Four"}
{"description": "The free agent signing period is well underway and it's been a rather quiet offseason for the Dallas Cowboys on that front. But rather quiet does not mean silent and the actions taken so far have certainly helped to shape the Dallas draft board ...", "title": "Dallas Cowboys Mock Draft: Post-Free Agency Predictions for Every Round"}
{"description": "ESPN's pre-draft \"On the Clock\" series takes a look at the Dallas Cowboys. These are roundtable discussions with Mel Kiper, Jr., Trent Dilfer and Chris Mortensen that preview the draft for each team and discuss other issues as well. Mel ...", "title": "Video: Dallas Cowboys on the clock"}
{"description": "COMMENTARY | How quickly we forget the days of Terence Newman, Pacman Jones and Anthony Henry. Thank goodness. I just had nightmares about thinking of those guys playing defensive back for the Dallas Cowboys. The grass is a little greener in terms of pass ...", "title": "Dallas Cowboys: High Expectations in 2013 for Brandon Carr and Morris Claiborne"}
{"description": "The Dallas Cowboys are less than a month away from one of the most important drafts in franchise history. It may sound like a bold statement to some, but it's a fair assessment when season after season ends in sheer disappointment. It's a ...", "title": "The Biggest Questions for the Dallas Cowboys Heading into the 2013 NFL Draft"}
{"description": "IRVING, Texas – Last week the Cowboys had a private workout with Texas safety Kenny Vaccaro. They saw him again Wednesday at the Longhorns’ pro day in Austin. Today the Cowboys signed veteran Will Allen to a one-year deal. So does it relate to Vaccaro ...", "title": "Cowboys: Barry Church"}
{"description": "SportsDay columnist Tim Cowlishaw answered reader questions about the Dallas Cowboys during a live chat Tuesday. Here are some highlights: Lots of talk about drafting 2 OL. Realistically, how effective will rookie OL be? Isn’t there a 2 to 3 ...", "title": "Cowlishaw: Why I wouldn’t be surprised to see Dallas Cowboys wait until 3rd round to draft an o-lineman"}
{"description": "SportsDay columnist Tim Cowlishaw answered reader questions about the Dallas Cowboys during a live chat Tuesday. Here are some highlights: What exactly is a Romo-friendly offense? Tim Cowlishaw: Only Jerry knows the answer to that one because ...", "title": "Cowlishaw: Redskins’ Dan Snyder has turned over ‘nation’s laughing stock’ rights to Jerry Jones, Dallas Cowboys"}
{"description": "With the 2013 NFL Draft scheduled for later this month, the Dallas Cowboys began hosting pre-draft visitors on Monday, with University of Texas safety Kenny Vaccaro being among the most notable names slated to make the trip to Valley Ranch. Dallas ...", "title": "Cowboys Kick Off Pre-Draft Visit Season"}
{"description": "Sometimes, it's very hard to face reality. But a new MEME is floating around the web that is making Dallas Cowboys fans do just that. First this week came the realization (and the huge backlash on Twitter) that the Cowboys just guaranteed Tony Romo 55 million.", "title": "MEME cuts Cowboys fans deep"}
{"description": "The New York Giants have something to prove in this season of the NFL as they have to defend their Super Bowl title. The Giants showed to the world that they can win the Super Bowl not only once but twice coming off a wildcard that they never need a bye in ...", "title": "NY Giants vs Dallas Cowboys: What a way for the NFL to start"}
{"description": "It’s not very often that a stud offensive lineman comes out of North Carolina, but Jonathan Cooper is attempting to buck that trend in the 2013 NFL Draft. The 6-foot-2, 310-pound guard is arguably the best in this year’s class with Alabama ...", "title": "Dallas Cowboys 2013 NFL Draft Prospect Profile: Jonathan Cooper"}
{"description": "USA Today's Tony Pauline has been told that UNC G Johnathan Cooper is one of the Cowboys' \"top first-round targets.\" It is an obvious fit, as Cooper projects to guard or center. Some rank the UNC interior lineman over Chance Warmack due to his ability to ...", "title": "Cowboys looking at Stanford RB Taylor"}
{"description": "Dallas Cowboys Now Married to Tony Romo: If it wasn’t clear before, it is now—the future of the Dallas Cowboys is going to be as bright as Tony Romo and Jerry Jones want it to be. Finding a quality starting quarterback in the NFL is not an easy thing ...", "title": "Dallas Cowboys Now Married to Tony Romo"}
{"description": "Looking at the most recent blockbuster trade involving Jarome Iginla, I am sure every team in the NHL wouldn’t mind adding a top player of his calibre. For the Ottawa Senator‘s sake, the best move on the April 3 trade deadline is no move at all.", "title": "Dallas Cowboys 2013 NFL Mock Draft, Week 4: 7 Rounds"}
{"description": "Anthony Spencer and the Dallas Cowboys haven’t been able to agree on a long-term contract extension, but that probably wasn’t on Spencer’s mind over the weekend. Spencer’s agent, Jordan Woy, confirmed Monday that his client recently got married.", "title": "Dallas Cowboys DE Anthony Spencer gets married over the weekend"}
{"description": "Looking at the most recent blockbuster trade involving Jarome Iginla, I am sure every team in the NHL wouldn’t mind adding a top player of his calibre. For the Ottawa Senator‘s sake, the best move on the April 3 trade deadline is no move at all.", "title": "Dallas Cowboys 2013 NFL Mock Draft, Week 4: 7 Rounds"}
{"description": "Anthony Spencer and the Dallas Cowboys haven’t been able to agree on a long-term contract extension, but that probably wasn’t on Spencer’s mind over the weekend. Spencer’s agent, Jordan Woy, confirmed Monday that his client recently got married.", "title": "Dallas Cowboys DE Anthony Spencer gets married over the weekend"}
{"description": "Reviewing the Cowboys’ 2008 draft: The NFL draft is right around the corner April 25-27 and before we dive more into the Dallas Cowboys’ needs and what direction they might go with their six selections, we’re going to take a step back and review.", "title": "Looking back at the Dallas Cowboys’ last five draft classes: 2008 has to be graded as a bust now with likely departures of free agents RB Felix Jones, CB Mike Jenkins"}
{"description": "Also, ex-Cowboys Kenyon Coleman will join Rob Ryan (and Victor Butler) in New Orleans. In case you missed it, Josh Brent's trial date has been set. Dallas Cowboys football player Josh Brent faces a Sept. 23 trial on a charge of intoxication ...", "title": "Cowboys News Links: Laurent Robinson Still In Play?"}
{"description": "Some may question the $108 million, six-year contract the Dallas Cowboys have given Tony Romo. But the Cowboys believe in the quarterback – that is why he got the deal that includes $55 million guaranteed. Ultimately, they are the only ones that matter.", "title": "Cowboys believe they can win Super Bowl with Tony Romo"}
{"description": "Outside linebacker Justin Durant has agreed to a two-year deal with the Dallas Cowboys which will be finalized when they clear enough cap space. So what now for the Detroit Lions? Durant spent the last two seasons with the Lions as a starter ...", "title": "DETROIT LIONS: Justin Durant headed to Dallas Cowboys"}
{"description": "Warmack could help the Cowboys fill a position of need if he’s still available ... He probably cares about winning more than anyone in Dallas.” Colombo respects Jones and said the owner can make tough choices with due diligence. Colombo holds fond ...", "title": "Colombo Thinks Warmack Should Be Cowboys’ First Pick"}
{"description": "So is the new contract the Dallas Cowboys intend on giving quarterback Tony Romo a reward? Or a matter of cap math? As Deion Sanders used to say in those pizza commercials … \"Both.\" On Wednesday, the Cowboys opened discussions with representatives for ...", "title": "Cowboys open extension talks with Romo"}
{"description": "Tony Romo could become a free agent next year if the Dallas Cowboys don’t complete a contract extension with him, NFL.com reported. The revelation stems from an apparent loophole in Romo’s contract that wouldn’t allow the Cowboys to apply ...", "title": "Report: Contract loophole prevents Cowboys from placing franchise tag on Romo"}
{"description": "To clear salary-cap space and lock up their franchise quarterback, the Dallas Cowboys and Tony Romo reached an agreement on a blockbuster six-year extension worth $108 million, making him the highest-paid player in franchise history. IRVING, Texas -- To ...", "title": "Cowboys' Romo gets 6-year, $108M extension"}
{"description": "The battle for the NFC East is at stake in the New York Giants vs Dallas Cowboys Sunday Night Football showdown at the Cowboys Stadium. It is the most important games for both teams because it determines whether the Cowboys will distance themselves or the ...", "title": "Giants vs Cowboys: A must win for New York"}
{"description": "The Dallas Cowboys enter the 2013 NFL Draft with needs on the offensive line, defensive line and secondary. With such a deep class along the trenches, they're in a good position to upgrade at least one of those positions with the 18th pick.", "title": "2013 NFL Mock Draft: Cowboys take Sheldon Richardson with 18th pick"}
{"description": "IRVING, Texas — Tony Romo and the Dallas Cowboys have agreed on a six-year contract extension worth $108 million, with about half of it guaranteed. The agreement was reported on the team’s website Friday. The deal will lower Romo’s salary ...", "title": "Dallas Cowboys, Tony Romo agree on 6-year, $108 million extension"}
{"description": "Quarterback Tony Romo agreed to a six-year, $108 million extension with the Dallas Cowboys, the team announced Friday. Combined with the $11.5 million Romo is due in 2013, he is now under contract for the next seven years at a total of $119.5 ...", "title": "NFL roundup: Cowboys' Romo agrees to six-year, $108 million extension"}
{"description": "I know a lot of NFC East observers are laughing about this, but should they be? The Dallas Cowboys have locked up their franchise quarterback, Tony... The word in Dallas is that quarterback Tony Romo is about to receive a massive payday ...", "title": "Cowboys"}
{"description": "The Lakers (38-36) will host the Dallas Mavericks (36-37) on Tuesday night, in a game that may have serious playoff implications. The Mavericks are 1 1/2 games behind the Lakers in the Western Conference. A Dallas win would make conference ...", "title": "Preview: Lakers vs. Dallas Mavericks"}
{"description": "If the Phoenix Murcery don’t draft Brittney Griner with the No. 1 overall pick in April’s draft, it may be a bigger shock than the Bears losing to Louisville in the Sweet 16. Griner’s dominance in the college game is unparalleled to anyone else who ...", "title": "Dallas Mavericks owner Mark Cuban says he’d let Baylor Bear Brittney Griner have a shot at making team roster"}
{"description": "A preseason guarantee that the Dallas Mavericks would be only a game and a half behind the Los Angeles Lakers when they left for this late-season trip to L.A. would have certainly pleased Dirk Nowitzki. The Mavs’ superstar just didn’t imagine that ...", "title": "Mavericks: Pau Gasol"}
{"description": "EL SEGUNDO, Calif. -- Los Angeles Lakers guard Steve Nash will not play in Tuesday's game against the Dallas Mavericks because of a strained right hip and hamstring. Steve Blake will start in Nash's place. Nash played just two minutes in the ...", "title": "Steve Nash won't play vs. Mavs"}
{"description": "For years, center Chris Kaman developed a reputation as one of the best scorers out of the post in the NBA. Now with the Dallas Mavericks, Kaman hasn’t been featured in the post as much as he should be. Kaman may be getting up there in age ...", "title": "Chris Kaman Has Been Underutilized By Dallas Mavericks"}
{"description": "It turned out to be the perfect trajectory for the Dallas Mavericks. Nowitzki hit a 3-pointer with 2.9 seconds left and the Mavericks rallied to beat the Chicago Bulls 100-98 on Saturday. \"This game was kind of like the story of our season,\" said Nowitzki ...", "title": "Nowitzki lifts Mavericks past Bulls 100-98"}
{"description": "DALLAS — Dirk Nowitzki finally leads the Dallas Mavericks in scoring again. He has more work to do if he wants to make the playoffs for a 13th straight season. The 7-foot German passed O.J. Mayo even before getting a season-high 35 and hitting a last ...", "title": "Nowitzki back where he belongs as leading scorer, helping Mavericks keep playoff push alive"}
{"description": "Pro Hoops on Tuesday and we will see the Dallas Mavericks travel to the Staples Center to take on the Los Angeles Lakers. The game is scheduled for a 10:30 pm (Eastern) start time and will be televised on TNT. Currently the Odds for the game ...", "title": "NBA Tuesday Dallas Mavericks at Los Angeles Lakers Odds, Start Time, Free Pick"}
{"description": "The Los Angeles Lakers have lost their hold on the eighth seed of the Western Conference playoff race, and with just a few games left in the season they'll need a victory over the Dallas Mavericks Tuesday night at 10:30 p.m. ET in order to keep ...", "title": "Dallas Mavericks Vs. Los Angeles Lakers Live Stream: Watch Online Tuesday Western Conference NBA Action At 10:30 PM ET"}
{"description": "The Los Angeles Lakers return home to face the surging Dallas Mavericks on Tuesday night from STAPLES Center. Head to head, the Mavericks are 4-1 ATS in the last 5 meetings in Los Angeles but just 1-5 ATS in the last 6 meetings, while the road ...", "title": "4/2/13 Dan’s Free NBA Basketball Pick Against the Spread"}
{"description": "The following appeared in the April 3, 2003 editions of The Dallas Morning News. Owner Donald Carter danced. Coach Richie Adubato pumped his fist. The triumphant Mavericks basked in a standing ovation from the Reunion Arena sellout crowd.", "title": "Flashback: Luck, 'stupidity' kept Shaquille O'Neal from being with Mavericks"}
{"description": "The Dallas Mavericks are peaking at the right time, but they're quickly running out of time to make the playoffs. The Mavericks begin a crucial four-game road trip Tuesday against the Los Angeles Lakers, who are a half-game behind eighth-place ...", "title": "Preview: Mavericks at Lakers"}
{"description": "DALLAS -- If the Dallas Mavericks somehow squeeze into the playoffs, it'll be on the back of Dirk Nowitzki. And what happened Saturday afternoon will have played a huge part. Nowitzki drilled a 3-pointer with two seconds left, finishing off a ...", "title": "Mavericks 100, Bulls 98"}
{"description": "Unless it’s a game in the NBA Playoffs, it’s very rare that one game could determine the outcome for two teams’ season. Most of the time, especially in the regular season, there are other chances for redemption or to gain more ground.", "title": "Dallas Mavericks Have Huge Game with Los Angeles Lakers On-Deck"}
{"description": "The Dallas Mavericks ended the fourth quarter on a 15-1 run to beat the Chicago Bulls, 100-98. Dirk Nowitzki had the best game of his 2012-13 campaign, with 35 points on 82.3 percent shooting from the field and 83.3 percent shooting from beyond the arc.", "title": "Chicago Bulls vs. Dallas Mavericks: Live Score, Results and Game Highlights"}
{"description": "The following appeared in the April 3, 2003 editions of The Dallas Morning News. Owner Donald Carter danced. Coach Richie Adubato pumped his fist. The triumphant Mavericks basked in a standing ovation from the Reunion Arena sellout crowd.", "title": "Flashback: Luck, 'stupidity' kept Shaquille O'Neal from being with Mavericks"}
{"description": "The Dallas Mavericks are peaking at the right time, but they're quickly running out of time to make the playoffs. The Mavericks begin a crucial four-game road trip Tuesday against the Los Angeles Lakers, who are a half-game behind eighth-place ...", "title": "Preview: Mavericks at Lakers"}
{"description": "DALLAS -- If the Dallas Mavericks somehow squeeze into the playoffs, it'll be on the back of Dirk Nowitzki. And what happened Saturday afternoon will have played a huge part. Nowitzki drilled a 3-pointer with two seconds left, finishing off a ...", "title": "Mavericks 100, Bulls 98"}
{"description": "Catch SportsDay On Air twice per week on Fox Sports Southwest, when Dallas Morning News experts discuss hot sports topics from the Cowboys, Mavericks, Stars, Rangers and colleges (check our TV listings for air times). Here are a few highlights ...", "title": "Sherrington: Why the Mavericks have a better chance at making the playoffs than the Lakers"}
{"description": "Unless it’s a game in the NBA Playoffs, it’s very rare that one game could determine the outcome for two teams’ season. Most of the time, especially in the regular season, there are other chances for redemption or to gain more ground.", "title": "Dallas Mavericks Have Huge Game with Los Angeles Lakers On-Deck"}
{"description": "The Dallas Mavericks ended the fourth quarter on a 15-1 run to beat the Chicago Bulls, 100-98. Dirk Nowitzki had the best game of his 2012-13 campaign, with 35 points on 82.3 percent shooting from the field and 83.3 percent shooting from beyond the arc.", "title": "Chicago Bulls vs. Dallas Mavericks: Live Score, Results and Game Highlights"}
{"description": "The Dallas Mavericks had their chance to pull to .500 and finally shave their beards pass them by on Thursday with a home loss to Indiana. The Mavericks will try to get back to within one game of the break-even mark when they host another ...", "title": "Preview: Bulls at Mavericks"}
{"description": "Carlos Boozer of the Chicago Bulls accidentally punched referee Danny Crawford in the groin during the second quarter of a 100-98 loss to the Dallas Mavericks on Saturday night. Boozer hit Crawford with a celebratory fist-pump with three ...", "title": "Chicago Bulls’ Carlos Boozer Punches Referee In Loss To Mavericks [Video]"}
{"description": "(AP) -- With their victory that ended the second-longest winning streak in NBA history, the short-handed Chicago Bulls proved they still have enough to play with any team in the league. Now they're hoping to carry over that momentum and win a season-high ...", "title": "Chicago Bulls at Dallas Mavericks"}
{"description": "After settling into her new home in Texas with newly traded Dallas Mavericks hubby Lamar Odom, Khloé Kardashian Odom has announced that she will be back on-air during the noon hour on Dallas radio station MIX 102.9! Life in Texas couldn’t be better for ...", "title": "Khloé Kardashian Odom Lands Radio Hosting Gig in Dallas"}
{"description": "Who doesn't know about Magic Johnson, Michael Jordan, or Vince Carter? NBA celebrities have held a position in North American households for decades. Basketball fans aspire to participating with their beloved team as they jab and spin with their teammates ...", "title": "Watch Basketball Los Angeles Lakers Vs. Dallas Mavericks Live Stream Online Free"}
{"description": "But the one he needed to go down? ‘‘Didn’t happen,’’ Robinson said after the Bulls’ 100-98 loss to the Dallas Mavericks at the American Airlines Center. And just like that, Robinson’s heroics went to waste. Despite a 25-point game in which he ...", "title": "Bulls give up late 12-point lead, fall to Mavericks"}
{"description": "DALLAS - Dirk Nowitzki hit a 3-pointer with 2.9 seconds left and the Dallas Mavericks rallied to beat the Chicago Bulls 100-98 on Saturday. The Mavericks trailed by 12 in the fourth quarter, but Nowitzki scored Dallas' last eight points in a ...", "title": "Nowitzki hits late 3 to win it for Dallas"}
{"description": "DALLAS (AP) — Paul George and Indiana Pacers went on an offensive surge in the third quarter to sink the Dallas Mavericks. However, all Pacers coach Frank Vogel could talk about was his top-ranked defense. George had 24 points and eight rebounds and the ...", "title": "George, Pacers topple Mavericks 103-78"}
{"description": "You can easily watch NBA Match Between Chicago Bulls VS Dallas Mavericks live stream online on pc here, just follow our streaming link. Enjoy Chicago Bulls VS Dallas Mavericks live stream Free NBA Game Online HD on your Pc. Ensure that you must ...", "title": "WaTcH Chicago Bulls VS Dallas Mavericks Live stream NBA online ON PC HD"}
