{"duke blue devils": ["College Football Nation: Duke Blue Devils", "Duke falls short again, losing 87-76 to Notre Dame", "Duke Basketball: Top 5 Highlights of the 2012-13 Season for the Blue Devils", "Skylar Diggins leads Notre Dame past Duke, to Final Four", "Duke-Notre Dame Preview", "UofL beats Duke 85-63, despite Kevin Ware's compound fracture", "Duke women fall to Notre Dame, 87-76, in NCAA basketball tourney", "Blue Devils Top Wildcats for Fifth Straight Win", "Irish women a big challenge for Duke", "Duke Tops Michigan State 71-61: Seth Curry Leads Blue Devils Past Spartans", "In 2013-14, Duke Blue Devils will be smaller, more athletic", "Duke Blue Devils versus Louisville Cardinals Pick Prediction NCAA Tournament College Basketball Betting Lines Odds Preview 3-31-2013", "Duke vs. Davidson l 6 PM l Durham Bulls Athletic Park", "Duke Women's Puts The Clamps On Nebraska To Become Elite", "Duke tangles with Louisville in Midwest Regional final", "Blue Devils headed to NCAA Elite Eight with win over Nebraska", "Duke Tops Michigan State 71-61: Seth Curry Leads Blue Devils Past Spartans", "In 2013-14, Duke Blue Devils will be smaller, more athletic", "Duke Blue Devils versus Louisville Cardinals Pick Prediction NCAA Tournament College Basketball Betting Lines Odds Preview 3-31-2013", "Duke vs. Davidson l 6 PM l Durham Bulls Athletic Park", "Duke Women's Puts The Clamps On Nebraska To Become Elite", "Duke tangles with Louisville in Midwest Regional final", "Editorial: Duke women keep the madness going", "Defense spearheads Duke Sweet 16 win over Cornhuskers", "Notre Dame women defeat Duke 87-76 to reach Final 4", "Twitter Reactions After Kevin Ware Breaks Leg During Louisville-Duke Game", "Duke Blue Devils", "Curry's hot shooting propels Duke to Elite Eight", "2013 NCAA Tournament: No. 2 Duke Blue Devils Offense A No Show In Elite Eight", "McCallie prepares Duke to continue along road to Final Four"], "texas aggies": ["Aggies Can't Avoid the Sweep", "Aggies up two spots to seventh at SDSU Farms Invitational", "Texas A&M recruiting goes westward looking to land Aggie legacy", "Texas A&M Football: 5 New Starters Imperative to the Aggies' Success in 2013", "Three Aggies earn SEC Athlete of the Week honors from Texas Relays performances", "Tell us: Will Texas or Texas A&M football have a better year in 2013?", "Texas A&M Aggies:", "Texas A&M Set to Host Aggie Invitational", "GLBT Aggies gear up for forum on anti-gay Student Senate bill", "Columnist rips Texas A&M's Johnny Manziel, Kevin Sumlin; Heisman winner needs to show 'maturity'", "Why Rick Perry picked a Democrat — and a trial lawyer — for the Aggie board of regents", "In Politics, Never Say Never to an Aggie", "Cessna: Aggie women's early exit from tournament not good enough for fans", "Aggies looking for leaders on defense", "Jack Pardee 'could adapt to anything'", "In Politics, Never Say Never to an Aggie", "Aggies looking for leaders on defense", "Jack Pardee 'could adapt to anything'", "Aggies Drop Series Finale to No. 4 Alabama, 4-1", "Longhorns defeat Aggies in 3,200-meter relay at Texas Relays", "Aggies Hit Road for SEC Series at South Carolina", "SEC: Texas A&M Aggies", "Nebraska takes down Aggies to advance to Sweet 16", "Aggies top (very) early team rankings", "Aggies must not exclude fellow students", "Texas A&M commit Nick Harvey visits Texas for spring game", "Aggie student leader proposes bill to opt out of paying for GLBT Center on campus", "Texas A&M alumni group helping Aggies attend Muster", "Thanks to the Aggies, Texas may have its opening to become a biotech hub", "Aggies top Alabama softball"], "dallas mavericks": ["Preview: Lakers vs. Dallas Mavericks", "Dallas Mavericks owner Mark Cuban says he’d let Baylor Bear Brittney Griner have a shot at making team roster", "Mavericks: Pau Gasol", "Steve Nash won't play vs. Mavs", "Chris Kaman Has Been Underutilized By Dallas Mavericks", "Nowitzki lifts Mavericks past Bulls 100-98", "Nowitzki back where he belongs as leading scorer, helping Mavericks keep playoff push alive", "NBA Tuesday Dallas Mavericks at Los Angeles Lakers Odds, Start Time, Free Pick", "Dallas Mavericks Vs. Los Angeles Lakers Live Stream: Watch Online Tuesday Western Conference NBA Action At 10:30 PM ET", "4/2/13 Dan’s Free NBA Basketball Pick Against the Spread", "Flashback: Luck, 'stupidity' kept Shaquille O'Neal from being with Mavericks", "Preview: Mavericks at Lakers", "Mavericks 100, Bulls 98", "Dallas Mavericks Have Huge Game with Los Angeles Lakers On-Deck", "Chicago Bulls vs. Dallas Mavericks: Live Score, Results and Game Highlights", "Flashback: Luck, 'stupidity' kept Shaquille O'Neal from being with Mavericks", "Preview: Mavericks at Lakers", "Mavericks 100, Bulls 98", "Sherrington: Why the Mavericks have a better chance at making the playoffs than the Lakers", "Dallas Mavericks Have Huge Game with Los Angeles Lakers On-Deck", "Chicago Bulls vs. Dallas Mavericks: Live Score, Results and Game Highlights", "Preview: Bulls at Mavericks", "Chicago Bulls’ Carlos Boozer Punches Referee In Loss To Mavericks [Video]", "Chicago Bulls at Dallas Mavericks", "Khloé Kardashian Odom Lands Radio Hosting Gig in Dallas", "Watch Basketball Los Angeles Lakers Vs. Dallas Mavericks Live Stream Online Free", "Bulls give up late 12-point lead, fall to Mavericks", "Nowitzki hits late 3 to win it for Dallas", "George, Pacers topple Mavericks 103-78", "WaTcH Chicago Bulls VS Dallas Mavericks Live stream NBA online ON PC HD"], "texas longhorns": ["Texas Longhorns spring football: Is Adrian Phillips back?", "Texas Football Spring Practice: Everything You Need to Know About the OL", "Researchers determine genetic ancestry of the Texas Longhorn", "Texas Longhorns recruiting: Spring game helps net five commitments", "Texas Football Recruiting: Breaking Down Longhorns' Newest 2014, 2015 Commits", "Texas Longhorns: Florida State Seminoles", "Texas Longhorns PG Myck Kabongo slips into first round in latest ESPN draft projections", "OL Cuney is No. 9 for Longhorns for 2014", "What Are The Expectations For The Texas Longhorns?", "The Texas Longhorns Number One Priority In 2013", "Pressel and Dubreuil record low finishes for No. 16 Women's Golf at Farms Invitational", "Universities trace origins of the Texas longhorn", "Texas A&M commit Nick Harvey visits Texas for spring game", "Texas longhorns roam in Putnam County", "Genes of Longhorn cattle show long history", "Texas A&M commit Nick Harvey visits Texas for spring game", "Texas longhorns roam in Putnam County", "Genes of Longhorn cattle show long history", "Texas tempo change: Horns new offense", "Texas Longhorn Genome Decoded", "Former Longhorn quarterback Colt McCoy traded to 49ers", "Texas vs Texas Tech: Football TV Channel Schedule, Game Time, Rivalry match", "Texas lands another", "Big 12: Texas Longhorns", "Texas squad outlasts Longhorns, 30-13, in Orange-White Scrimmage", "Longhorns' McClellan will transfer", "2015 DT Bryce English commits to the Texas Longhorns", "A former Texas player nails the Longhorns' second biggest problem", "No. 4 Men's Track and Field wraps up Clyde Littlefield Texas Relays with six wins", "Texas’ pro day: Former Longhorns QB Vince Young takes advantage of almost certainly his last chance to work his back into NFL"], "dallas cowboys": ["Dallas Cowboys Mock Draft: Post-Free Agency Predictions for Every Round", "Video: Dallas Cowboys on the clock", "Dallas Cowboys: High Expectations in 2013 for Brandon Carr and Morris Claiborne", "The Biggest Questions for the Dallas Cowboys Heading into the 2013 NFL Draft", "Cowboys: Barry Church", "Cowlishaw: Why I wouldn’t be surprised to see Dallas Cowboys wait until 3rd round to draft an o-lineman", "Cowlishaw: Redskins’ Dan Snyder has turned over ‘nation’s laughing stock’ rights to Jerry Jones, Dallas Cowboys", "Cowboys Kick Off Pre-Draft Visit Season", "MEME cuts Cowboys fans deep", "NY Giants vs Dallas Cowboys: What a way for the NFL to start", "Dallas Cowboys 2013 NFL Draft Prospect Profile: Jonathan Cooper", "Cowboys looking at Stanford RB Taylor", "Dallas Cowboys Now Married to Tony Romo", "Dallas Cowboys 2013 NFL Mock Draft, Week 4: 7 Rounds", "Dallas Cowboys DE Anthony Spencer gets married over the weekend", "Dallas Cowboys 2013 NFL Mock Draft, Week 4: 7 Rounds", "Dallas Cowboys DE Anthony Spencer gets married over the weekend", "Looking back at the Dallas Cowboys’ last five draft classes: 2008 has to be graded as a bust now with likely departures of free agents RB Felix Jones, CB Mike Jenkins", "Cowboys News Links: Laurent Robinson Still In Play?", "Cowboys believe they can win Super Bowl with Tony Romo", "DETROIT LIONS: Justin Durant headed to Dallas Cowboys", "Colombo Thinks Warmack Should Be Cowboys’ First Pick", "Cowboys open extension talks with Romo", "Report: Contract loophole prevents Cowboys from placing franchise tag on Romo", "Cowboys' Romo gets 6-year, $108M extension", "Giants vs Cowboys: A must win for New York", "2013 NFL Mock Draft: Cowboys take Sheldon Richardson with 18th pick", "Dallas Cowboys, Tony Romo agree on 6-year, $108 million extension", "NFL roundup: Cowboys' Romo agrees to six-year, $108 million extension", "Cowboys"]}